Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
extern volatile __NVMCON2bits_t NVMCON2bits __asm__ ("NVMCON2") __attribute__((section("sfrs"), address(0xBF800AA0)));
extern volatile uint32_t        NVMCON2CLR __attribute__((section("sfrs"),address(0xBF800AA4)));
extern volatile uint32_t        NVMCON2SET __attribute__((section("sfrs"),address(0xBF800AA8)));
extern volatile uint32_t        NVMCON2INV __attribute__((section("sfrs"),address(0xBF800AAC)));
#define WDTCON WDTCON
extern volatile uint32_t   WDTCON __attribute__((section("sfrs"), address(0xBF800C00)));
typedef struct {
  uint32_t WDTWINEN:1;
  uint32_t SLPDIV:5;
  uint32_t :2;
  uint32_t RUNDIV:5;
  uint32_t :2;
  uint32_t ON:1;
  uint32_t WDTCLRKEY:16;
} __WDTCONbits_t;
extern volatile __WDTCONbits_t WDTCONbits __asm__ ("WDTCON") __attribute__((section("sfrs"), address(0xBF800C00)));
extern volatile uint32_t        WDTCONCLR __attribute__((section("sfrs"),address(0xBF800C04)));
extern volatile uint32_t        WDTCONSET __attribute__((section("sfrs"),address(0xBF800C08)));
extern volatile uint32_t        WDTCONINV __attribute__((section("sfrs"),address(0xBF800C0C)));
#define DMTCON DMTCON
extern volatile uint32_t   DMTCON __attribute__((section("sfrs"), address(0xBF800E00)));
typedef struct {
  uint32_t :15;
  uint32_t ON:1;
} __DMTCONbits_t;
extern volatile __DMTCONbits_t DMTCONbits __asm__ ("DMTCON") __attribute__((section("sfrs"), address(0xBF800E00)));
#define DMTPRECLR DMTPRECLR
extern volatile uint32_t   DMTPRECLR __attribute__((section("sfrs"), address(0xBF800E10)));
typedef struct {
  uint32_t :8;
  uint32_t STEP1:8;
} __DMTPRECLRbits_t;
extern volatile __DMTPRECLRbits_t DMTPRECLRbits __asm__ ("DMTPRECLR") __attribute__((section("sfrs"), address(0xBF800E10)));
#define DMTCLR DMTCLR
extern volatile uint32_t   DMTCLR __attribute__((section("sfrs"), address(0xBF800E20)));
typedef struct {
  uint32_t STEP2:8;
} __DMTCLRbits_t;
extern volatile __DMTCLRbits_t DMTCLRbits __asm__ ("DMTCLR") __attribute__((section("sfrs"), address(0xBF800E20)));
#define DMTSTAT DMTSTAT
extern volatile uint32_t   DMTSTAT __attribute__((section("sfrs"), address(0xBF800E30)));
typedef union {
  struct {
    uint32_t WINOPN:1;
    uint32_t :4;
    uint32_t DMTEVENT:1;
    uint32_t BAD:2;
  };
  struct {
    uint32_t :6;
    uint32_t BAD2:1;
    uint32_t BAD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __DMTSTATbits_t;
extern volatile __DMTSTATbits_t DMTSTATbits __asm__ ("DMTSTAT") __attribute__((section("sfrs"), address(0xBF800E30)));
#define DMTCNT DMTCNT
extern volatile uint32_t   DMTCNT __attribute__((section("sfrs"), address(0xBF800E40)));
typedef struct {
  uint32_t COUNTER:32;
} __DMTCNTbits_t;
extern volatile __DMTCNTbits_t DMTCNTbits __asm__ ("DMTCNT") __attribute__((section("sfrs"), address(0xBF800E40)));
#define DMTPSCNT DMTPSCNT
extern volatile uint32_t   DMTPSCNT __attribute__((section("sfrs"), address(0xBF800E60)));
typedef struct {
  uint32_t PSCNT:32;
} __DMTPSCNTbits_t;
extern volatile __DMTPSCNTbits_t DMTPSCNTbits __asm__ ("DMTPSCNT") __attribute__((section("sfrs"), address(0xBF800E60)));
#define DMTPSINTV DMTPSINTV
extern volatile uint32_t   DMTPSINTV __attribute__((section("sfrs"), address(0xBF800E70)));
typedef struct {
  uint32_t PSINTV:32;
} __DMTPSINTVbits_t;
extern volatile __DMTPSINTVbits_t DMTPSINTVbits __asm__ ("DMTPSINTV") __attribute__((section("sfrs"), address(0xBF800E70)));
#define _ICDCON _ICDCON
extern volatile uint32_t   _ICDCON __attribute__((section("sfrs"), address(0xBF801000)));
typedef struct {
  uint32_t CKSWBKEN:1;
  uint32_t SLPBKEN:1;
  uint32_t WDTBKEN:1;
  uint32_t WDTEN:1;
  uint32_t RSTBUG:1;
  uint32_t DMTBKEN:1;
  uint32_t DMTEN:1;
  uint32_t :7;
  uint32_t FRZ:1;
} ___ICDCONbits_t;
extern volatile ___ICDCONbits_t _ICDCONbits __asm__ ("_ICDCON") __attribute__((section("sfrs"), address(0xBF801000)));
#define _ICDSTAT _ICDSTAT
extern volatile uint32_t   _ICDSTAT __attribute__((section("sfrs"), address(0xBF801010)));
typedef struct {
  uint32_t CKSWBF:1;
  uint32_t SLPBF:1;
  uint32_t WDTBF:1;
  uint32_t DMTBF:1;
  uint32_t WDTRUNBF:1;
  uint32_t WDTSLPBF:1;
} ___ICDSTATbits_t;
extern volatile ___ICDSTATbits_t _ICDSTATbits __asm__ ("_ICDSTAT") __attribute__((section("sfrs"), address(0xBF801010)));
#define OSCCON OSCCON
extern volatile uint32_t   OSCCON __attribute__((section("sfrs"), address(0xBF801200)));
typedef struct {
  uint32_t OSWEN:1;
  uint32_t SOSCEN:1;
  uint32_t UFRCEN:1;
  uint32_t CF:1;
  uint32_t SLPEN:1;
  uint32_t :2;
  uint32_t CLKLOCK:1;
  uint32_t NOSC:3;
  uint32_t :1;
  uint32_t COSC:3;
  uint32_t :6;
  uint32_t SLP2SPD:1;
  uint32_t :1;
  uint32_t DRMEN:1;
  uint32_t FRCDIV:3;
} __OSCCONbits_t;
extern volatile __OSCCONbits_t OSCCONbits __asm__ ("OSCCON") __attribute__((section("sfrs"), address(0xBF801200)));
extern volatile uint32_t        OSCCONCLR __attribute__((section("sfrs"),address(0xBF801204)));
extern volatile uint32_t        OSCCONSET __attribute__((section("sfrs"),address(0xBF801208)));
extern volatile uint32_t        OSCCONINV __attribute__((section("sfrs"),address(0xBF80120C)));
#define OSCTUN OSCTUN
extern volatile uint32_t   OSCTUN __attribute__((section("sfrs"), address(0xBF801210)));
typedef struct {
  uint32_t TUN:6;
} __OSCTUNbits_t;
extern volatile __OSCTUNbits_t OSCTUNbits __asm__ ("OSCTUN") __attribute__((section("sfrs"), address(0xBF801210)));
extern volatile uint32_t        OSCTUNCLR __attribute__((section("sfrs"),address(0xBF801214)));
extern volatile uint32_t        OSCTUNSET __attribute__((section("sfrs"),address(0xBF801218)));
extern volatile uint32_t        OSCTUNINV __attribute__((section("sfrs"),address(0xBF80121C)));
#define SPLLCON SPLLCON
extern volatile uint32_t   SPLLCON __attribute__((section("sfrs"), address(0xBF801220)));
typedef struct {
  uint32_t PLLRANGE:3;
  uint32_t :4;
  uint32_t PLLICLK:1;
  uint32_t PLLIDIV:3;
  uint32_t :5;
  uint32_t PLLMULT:7;
  uint32_t :1;
  uint32_t PLLODIV:3;
} __SPLLCONbits_t;
extern volatile __SPLLCONbits_t SPLLCONbits __asm__ ("SPLLCON") __attribute__((section("sfrs"), address(0xBF801220)));
extern volatile uint32_t        SPLLCONCLR __attribute__((section("sfrs"),address(0xBF801224)));
extern volatile uint32_t        SPLLCONSET __attribute__((section("sfrs"),address(0xBF801228)));
extern volatile uint32_t        SPLLCONINV __attribute__((section("sfrs"),address(0xBF80122C)));
#define UPLLCON UPLLCON
extern volatile uint32_t   UPLLCON __attribute__((section("sfrs"), address(0xBF801230)));
typedef struct {
  uint32_t PLLRANGE:3;
  uint32_t :5;
  uint32_t PLLIDIV:3;
  uint32_t :5;
  uint32_t PLLMULT:7;
  uint32_t :1;
  uint32_t PLLODIV:3;
  uint32_t :2;
  uint32_t UPOSCEN:1;
} __UPLLCONbits_t;
extern volatile __UPLLCONbits_t UPLLCONbits __asm__ ("UPLLCON") __attribute__((section("sfrs"), address(0xBF801230)));
extern volatile uint32_t        UPLLCONCLR __attribute__((section("sfrs"),address(0xBF801234)));
extern volatile uint32_t        UPLLCONSET __attribute__((section("sfrs"),address(0xBF801238)));
extern volatile uint32_t        UPLLCONINV __attribute__((section("sfrs"),address(0xBF80123C)));
#define RCON RCON
extern volatile uint32_t   RCON __attribute__((section("sfrs"), address(0xBF801240)));
typedef struct {
  uint32_t POR:1;
  uint32_t BOR:1;
  uint32_t IDLE:1;
  uint32_t SLEEP:1;
  uint32_t WDTO:1;
  uint32_t DMTO:1;
  uint32_t SWR:1;
  uint32_t EXTR:1;
  uint32_t :1;
  uint32_t CMR:1;
  uint32_t DPSLP:1;
  uint32_t :5;
  uint32_t VBAT:1;
  uint32_t VBPOR:1;
  uint32_t :12;
  uint32_t PORCORE:1;
  uint32_t PORIO:1;
} __RCONbits_t;
extern volatile __RCONbits_t RCONbits __asm__ ("RCON") __attribute__((section("sfrs"), address(0xBF801240)));
extern volatile uint32_t        RCONCLR __attribute__((section("sfrs"),address(0xBF801244)));
extern volatile uint32_t        RCONSET __attribute__((section("sfrs"),address(0xBF801248)));
extern volatile uint32_t        RCONINV __attribute__((section("sfrs"),address(0xBF80124C)));
#define RSWRST RSWRST
extern volatile uint32_t   RSWRST __attribute__((section("sfrs"), address(0xBF801250)));
typedef struct {
  uint32_t SWRST:1;
} __RSWRSTbits_t;
extern volatile __RSWRSTbits_t RSWRSTbits __asm__ ("RSWRST") __attribute__((section("sfrs"), address(0xBF801250)));
extern volatile uint32_t        RSWRSTCLR __attribute__((section("sfrs"),address(0xBF801254)));
extern volatile uint32_t        RSWRSTSET __attribute__((section("sfrs"),address(0xBF801258)));
extern volatile uint32_t        RSWRSTINV __attribute__((section("sfrs"),address(0xBF80125C)));
#define RNMICON RNMICON
extern volatile uint32_t   RNMICON __attribute__((section("sfrs"), address(0xBF801260)));
typedef struct {
  uint32_t NMICNT:16;
  uint32_t WDTS:1;
  uint32_t CF:1;
  uint32_t HLVD:1;
  uint32_t GNMI:1;
  uint32_t :3;
  uint32_t SWNMI:1;
  uint32_t WDTO:1;
  uint32_t DMTO:1;
} __RNMICONbits_t;
extern volatile __RNMICONbits_t RNMICONbits __asm__ ("RNMICON") __attribute__((section("sfrs"), address(0xBF801260)));
extern volatile uint32_t        RNMICONCLR __attribute__((section("sfrs"),address(0xBF801264)));
extern volatile uint32_t        RNMICONSET __attribute__((section("sfrs"),address(0xBF801268)));
extern volatile uint32_t        RNMICONINV __attribute__((section("sfrs"),address(0xBF80126C)));
#define PWRCON PWRCON
extern volatile uint32_t   PWRCON __attribute__((section("sfrs"), address(0xBF801270)));
typedef struct {
  uint32_t VREGS:1;
  uint32_t :3;
  uint32_t VREGSLP:2;
  uint32_t VREGRUN:2;
} __PWRCONbits_t;
