Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
extern volatile __STRIG4bits_t STRIG4bits __asm__ ("STRIG4") __attribute__((section("sfrs"), address(0xBF82A460)));
extern volatile uint32_t        STRIG4CLR __attribute__((section("sfrs"),address(0xBF82A464)));
extern volatile uint32_t        STRIG4SET __attribute__((section("sfrs"),address(0xBF82A468)));
extern volatile uint32_t        STRIG4INV __attribute__((section("sfrs"),address(0xBF82A46C)));
#define CAP4 CAP4
extern volatile uint32_t   CAP4 __attribute__((section("sfrs"), address(0xBF82A470)));
typedef struct {
  uint32_t CAP:16;
} __CAP4bits_t;
extern volatile __CAP4bits_t CAP4bits __asm__ ("CAP4") __attribute__((section("sfrs"), address(0xBF82A470)));
extern volatile uint32_t        CAP4CLR __attribute__((section("sfrs"),address(0xBF82A474)));
extern volatile uint32_t        CAP4SET __attribute__((section("sfrs"),address(0xBF82A478)));
extern volatile uint32_t        CAP4INV __attribute__((section("sfrs"),address(0xBF82A47C)));
#define LEBCON4 LEBCON4
extern volatile uint32_t   LEBCON4 __attribute__((section("sfrs"), address(0xBF82A480)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON4bits_t;
extern volatile __LEBCON4bits_t LEBCON4bits __asm__ ("LEBCON4") __attribute__((section("sfrs"), address(0xBF82A480)));
extern volatile uint32_t        LEBCON4CLR __attribute__((section("sfrs"),address(0xBF82A484)));
extern volatile uint32_t        LEBCON4SET __attribute__((section("sfrs"),address(0xBF82A488)));
extern volatile uint32_t        LEBCON4INV __attribute__((section("sfrs"),address(0xBF82A48C)));
#define LEBDLY4 LEBDLY4
extern volatile uint32_t   LEBDLY4 __attribute__((section("sfrs"), address(0xBF82A490)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY4bits_t;
extern volatile __LEBDLY4bits_t LEBDLY4bits __asm__ ("LEBDLY4") __attribute__((section("sfrs"), address(0xBF82A490)));
extern volatile uint32_t        LEBDLY4CLR __attribute__((section("sfrs"),address(0xBF82A494)));
extern volatile uint32_t        LEBDLY4SET __attribute__((section("sfrs"),address(0xBF82A498)));
extern volatile uint32_t        LEBDLY4INV __attribute__((section("sfrs"),address(0xBF82A49C)));
#define AUXCON4 AUXCON4
extern volatile uint32_t   AUXCON4 __attribute__((section("sfrs"), address(0xBF82A4A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON4bits_t;
extern volatile __AUXCON4bits_t AUXCON4bits __asm__ ("AUXCON4") __attribute__((section("sfrs"), address(0xBF82A4A0)));
extern volatile uint32_t        AUXCON4CLR __attribute__((section("sfrs"),address(0xBF82A4A4)));
extern volatile uint32_t        AUXCON4SET __attribute__((section("sfrs"),address(0xBF82A4A8)));
extern volatile uint32_t        AUXCON4INV __attribute__((section("sfrs"),address(0xBF82A4AC)));
#define PTMR4 PTMR4
extern volatile uint32_t   PTMR4 __attribute__((section("sfrs"), address(0xBF82A4B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR4bits_t;
extern volatile __PTMR4bits_t PTMR4bits __asm__ ("PTMR4") __attribute__((section("sfrs"), address(0xBF82A4B0)));
extern volatile uint32_t        PTMR4CLR __attribute__((section("sfrs"),address(0xBF82A4B4)));
extern volatile uint32_t        PTMR4SET __attribute__((section("sfrs"),address(0xBF82A4B8)));
extern volatile uint32_t        PTMR4INV __attribute__((section("sfrs"),address(0xBF82A4BC)));
#define PWMCON5 PWMCON5
extern volatile uint32_t   PWMCON5 __attribute__((section("sfrs"), address(0xBF82A4C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON5bits_t;
extern volatile __PWMCON5bits_t PWMCON5bits __asm__ ("PWMCON5") __attribute__((section("sfrs"), address(0xBF82A4C0)));
extern volatile uint32_t        PWMCON5CLR __attribute__((section("sfrs"),address(0xBF82A4C4)));
extern volatile uint32_t        PWMCON5SET __attribute__((section("sfrs"),address(0xBF82A4C8)));
extern volatile uint32_t        PWMCON5INV __attribute__((section("sfrs"),address(0xBF82A4CC)));
#define IOCON5 IOCON5
extern volatile uint32_t   IOCON5 __attribute__((section("sfrs"), address(0xBF82A4D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON5bits_t;
extern volatile __IOCON5bits_t IOCON5bits __asm__ ("IOCON5") __attribute__((section("sfrs"), address(0xBF82A4D0)));
extern volatile uint32_t        IOCON5CLR __attribute__((section("sfrs"),address(0xBF82A4D4)));
extern volatile uint32_t        IOCON5SET __attribute__((section("sfrs"),address(0xBF82A4D8)));
extern volatile uint32_t        IOCON5INV __attribute__((section("sfrs"),address(0xBF82A4DC)));
#define PDC5 PDC5
extern volatile uint32_t   PDC5 __attribute__((section("sfrs"), address(0xBF82A4E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC5bits_t;
extern volatile __PDC5bits_t PDC5bits __asm__ ("PDC5") __attribute__((section("sfrs"), address(0xBF82A4E0)));
extern volatile uint32_t        PDC5CLR __attribute__((section("sfrs"),address(0xBF82A4E4)));
extern volatile uint32_t        PDC5SET __attribute__((section("sfrs"),address(0xBF82A4E8)));
extern volatile uint32_t        PDC5INV __attribute__((section("sfrs"),address(0xBF82A4EC)));
#define SDC5 SDC5
extern volatile uint32_t   SDC5 __attribute__((section("sfrs"), address(0xBF82A4F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC5bits_t;
extern volatile __SDC5bits_t SDC5bits __asm__ ("SDC5") __attribute__((section("sfrs"), address(0xBF82A4F0)));
extern volatile uint32_t        SDC5CLR __attribute__((section("sfrs"),address(0xBF82A4F4)));
extern volatile uint32_t        SDC5SET __attribute__((section("sfrs"),address(0xBF82A4F8)));
extern volatile uint32_t        SDC5INV __attribute__((section("sfrs"),address(0xBF82A4FC)));
#define PHASE5 PHASE5
extern volatile uint32_t   PHASE5 __attribute__((section("sfrs"), address(0xBF82A500)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE5bits_t;
extern volatile __PHASE5bits_t PHASE5bits __asm__ ("PHASE5") __attribute__((section("sfrs"), address(0xBF82A500)));
extern volatile uint32_t        PHASE5CLR __attribute__((section("sfrs"),address(0xBF82A504)));
extern volatile uint32_t        PHASE5SET __attribute__((section("sfrs"),address(0xBF82A508)));
extern volatile uint32_t        PHASE5INV __attribute__((section("sfrs"),address(0xBF82A50C)));
#define DTR5 DTR5
extern volatile uint32_t   DTR5 __attribute__((section("sfrs"), address(0xBF82A510)));
typedef struct {
  uint32_t DTR:16;
} __DTR5bits_t;
