Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
extern volatile __PTMR6bits_t PTMR6bits __asm__ ("PTMR6") __attribute__((section("sfrs"), address(0xBF82A6B0)));
extern volatile uint32_t        PTMR6CLR __attribute__((section("sfrs"),address(0xBF82A6B4)));
extern volatile uint32_t        PTMR6SET __attribute__((section("sfrs"),address(0xBF82A6B8)));
extern volatile uint32_t        PTMR6INV __attribute__((section("sfrs"),address(0xBF82A6BC)));
#define PWMCON7 PWMCON7
extern volatile uint32_t   PWMCON7 __attribute__((section("sfrs"), address(0xBF82A6C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON7bits_t;
extern volatile __PWMCON7bits_t PWMCON7bits __asm__ ("PWMCON7") __attribute__((section("sfrs"), address(0xBF82A6C0)));
extern volatile uint32_t        PWMCON7CLR __attribute__((section("sfrs"),address(0xBF82A6C4)));
extern volatile uint32_t        PWMCON7SET __attribute__((section("sfrs"),address(0xBF82A6C8)));
extern volatile uint32_t        PWMCON7INV __attribute__((section("sfrs"),address(0xBF82A6CC)));
#define IOCON7 IOCON7
extern volatile uint32_t   IOCON7 __attribute__((section("sfrs"), address(0xBF82A6D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON7bits_t;
extern volatile __IOCON7bits_t IOCON7bits __asm__ ("IOCON7") __attribute__((section("sfrs"), address(0xBF82A6D0)));
extern volatile uint32_t        IOCON7CLR __attribute__((section("sfrs"),address(0xBF82A6D4)));
extern volatile uint32_t        IOCON7SET __attribute__((section("sfrs"),address(0xBF82A6D8)));
extern volatile uint32_t        IOCON7INV __attribute__((section("sfrs"),address(0xBF82A6DC)));
#define PDC7 PDC7
extern volatile uint32_t   PDC7 __attribute__((section("sfrs"), address(0xBF82A6E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC7bits_t;
extern volatile __PDC7bits_t PDC7bits __asm__ ("PDC7") __attribute__((section("sfrs"), address(0xBF82A6E0)));
extern volatile uint32_t        PDC7CLR __attribute__((section("sfrs"),address(0xBF82A6E4)));
extern volatile uint32_t        PDC7SET __attribute__((section("sfrs"),address(0xBF82A6E8)));
extern volatile uint32_t        PDC7INV __attribute__((section("sfrs"),address(0xBF82A6EC)));
#define SDC7 SDC7
extern volatile uint32_t   SDC7 __attribute__((section("sfrs"), address(0xBF82A6F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC7bits_t;
extern volatile __SDC7bits_t SDC7bits __asm__ ("SDC7") __attribute__((section("sfrs"), address(0xBF82A6F0)));
extern volatile uint32_t        SDC7CLR __attribute__((section("sfrs"),address(0xBF82A6F4)));
extern volatile uint32_t        SDC7SET __attribute__((section("sfrs"),address(0xBF82A6F8)));
extern volatile uint32_t        SDC7INV __attribute__((section("sfrs"),address(0xBF82A6FC)));
#define PHASE7 PHASE7
extern volatile uint32_t   PHASE7 __attribute__((section("sfrs"), address(0xBF82A700)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE7bits_t;
extern volatile __PHASE7bits_t PHASE7bits __asm__ ("PHASE7") __attribute__((section("sfrs"), address(0xBF82A700)));
extern volatile uint32_t        PHASE7CLR __attribute__((section("sfrs"),address(0xBF82A704)));
extern volatile uint32_t        PHASE7SET __attribute__((section("sfrs"),address(0xBF82A708)));
extern volatile uint32_t        PHASE7INV __attribute__((section("sfrs"),address(0xBF82A70C)));
#define DTR7 DTR7
extern volatile uint32_t   DTR7 __attribute__((section("sfrs"), address(0xBF82A710)));
typedef struct {
  uint32_t DTR:16;
} __DTR7bits_t;
extern volatile __DTR7bits_t DTR7bits __asm__ ("DTR7") __attribute__((section("sfrs"), address(0xBF82A710)));
extern volatile uint32_t        DTR7CLR __attribute__((section("sfrs"),address(0xBF82A714)));
extern volatile uint32_t        DTR7SET __attribute__((section("sfrs"),address(0xBF82A718)));
extern volatile uint32_t        DTR7INV __attribute__((section("sfrs"),address(0xBF82A71C)));
#define ALTDTR7 ALTDTR7
extern volatile uint32_t   ALTDTR7 __attribute__((section("sfrs"), address(0xBF82A720)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR7bits_t;
extern volatile __ALTDTR7bits_t ALTDTR7bits __asm__ ("ALTDTR7") __attribute__((section("sfrs"), address(0xBF82A720)));
extern volatile uint32_t        ALTDTR7CLR __attribute__((section("sfrs"),address(0xBF82A724)));
extern volatile uint32_t        ALTDTR7SET __attribute__((section("sfrs"),address(0xBF82A728)));
extern volatile uint32_t        ALTDTR7INV __attribute__((section("sfrs"),address(0xBF82A72C)));
#define DTCOMP7 DTCOMP7
extern volatile uint32_t   DTCOMP7 __attribute__((section("sfrs"), address(0xBF82A730)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP7bits_t;
extern volatile __DTCOMP7bits_t DTCOMP7bits __asm__ ("DTCOMP7") __attribute__((section("sfrs"), address(0xBF82A730)));
extern volatile uint32_t        DTCOMP7CLR __attribute__((section("sfrs"),address(0xBF82A734)));
extern volatile uint32_t        DTCOMP7SET __attribute__((section("sfrs"),address(0xBF82A738)));
extern volatile uint32_t        DTCOMP7INV __attribute__((section("sfrs"),address(0xBF82A73C)));
#define TRIG7 TRIG7
extern volatile uint32_t   TRIG7 __attribute__((section("sfrs"), address(0xBF82A740)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG7bits_t;
extern volatile __TRIG7bits_t TRIG7bits __asm__ ("TRIG7") __attribute__((section("sfrs"), address(0xBF82A740)));
extern volatile uint32_t        TRIG7CLR __attribute__((section("sfrs"),address(0xBF82A744)));
extern volatile uint32_t        TRIG7SET __attribute__((section("sfrs"),address(0xBF82A748)));
extern volatile uint32_t        TRIG7INV __attribute__((section("sfrs"),address(0xBF82A74C)));
#define TRGCON7 TRGCON7
extern volatile uint32_t   TRGCON7 __attribute__((section("sfrs"), address(0xBF82A750)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON7bits_t;
extern volatile __TRGCON7bits_t TRGCON7bits __asm__ ("TRGCON7") __attribute__((section("sfrs"), address(0xBF82A750)));
extern volatile uint32_t        TRGCON7CLR __attribute__((section("sfrs"),address(0xBF82A754)));
extern volatile uint32_t        TRGCON7SET __attribute__((section("sfrs"),address(0xBF82A758)));
extern volatile uint32_t        TRGCON7INV __attribute__((section("sfrs"),address(0xBF82A75C)));
#define STRIG7 STRIG7
extern volatile uint32_t   STRIG7 __attribute__((section("sfrs"), address(0xBF82A760)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG7bits_t;
