Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
extern volatile __DTR11bits_t DTR11bits __asm__ ("DTR11") __attribute__((section("sfrs"), address(0xBF82AB10)));
extern volatile uint32_t        DTR11CLR __attribute__((section("sfrs"),address(0xBF82AB14)));
extern volatile uint32_t        DTR11SET __attribute__((section("sfrs"),address(0xBF82AB18)));
extern volatile uint32_t        DTR11INV __attribute__((section("sfrs"),address(0xBF82AB1C)));
#define ALTDTR11 ALTDTR11
extern volatile uint32_t   ALTDTR11 __attribute__((section("sfrs"), address(0xBF82AB20)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR11bits_t;
extern volatile __ALTDTR11bits_t ALTDTR11bits __asm__ ("ALTDTR11") __attribute__((section("sfrs"), address(0xBF82AB20)));
extern volatile uint32_t        ALTDTR11CLR __attribute__((section("sfrs"),address(0xBF82AB24)));
extern volatile uint32_t        ALTDTR11SET __attribute__((section("sfrs"),address(0xBF82AB28)));
extern volatile uint32_t        ALTDTR11INV __attribute__((section("sfrs"),address(0xBF82AB2C)));
#define DTCOMP11 DTCOMP11
extern volatile uint32_t   DTCOMP11 __attribute__((section("sfrs"), address(0xBF82AB30)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP11bits_t;
extern volatile __DTCOMP11bits_t DTCOMP11bits __asm__ ("DTCOMP11") __attribute__((section("sfrs"), address(0xBF82AB30)));
extern volatile uint32_t        DTCOMP11CLR __attribute__((section("sfrs"),address(0xBF82AB34)));
extern volatile uint32_t        DTCOMP11SET __attribute__((section("sfrs"),address(0xBF82AB38)));
extern volatile uint32_t        DTCOMP11INV __attribute__((section("sfrs"),address(0xBF82AB3C)));
#define TRIG11 TRIG11
extern volatile uint32_t   TRIG11 __attribute__((section("sfrs"), address(0xBF82AB40)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG11bits_t;
extern volatile __TRIG11bits_t TRIG11bits __asm__ ("TRIG11") __attribute__((section("sfrs"), address(0xBF82AB40)));
extern volatile uint32_t        TRIG11CLR __attribute__((section("sfrs"),address(0xBF82AB44)));
extern volatile uint32_t        TRIG11SET __attribute__((section("sfrs"),address(0xBF82AB48)));
extern volatile uint32_t        TRIG11INV __attribute__((section("sfrs"),address(0xBF82AB4C)));
#define TRGCON11 TRGCON11
extern volatile uint32_t   TRGCON11 __attribute__((section("sfrs"), address(0xBF82AB50)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON11bits_t;
extern volatile __TRGCON11bits_t TRGCON11bits __asm__ ("TRGCON11") __attribute__((section("sfrs"), address(0xBF82AB50)));
extern volatile uint32_t        TRGCON11CLR __attribute__((section("sfrs"),address(0xBF82AB54)));
extern volatile uint32_t        TRGCON11SET __attribute__((section("sfrs"),address(0xBF82AB58)));
extern volatile uint32_t        TRGCON11INV __attribute__((section("sfrs"),address(0xBF82AB5C)));
#define STRIG11 STRIG11
extern volatile uint32_t   STRIG11 __attribute__((section("sfrs"), address(0xBF82AB60)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG11bits_t;
extern volatile __STRIG11bits_t STRIG11bits __asm__ ("STRIG11") __attribute__((section("sfrs"), address(0xBF82AB60)));
extern volatile uint32_t        STRIG11CLR __attribute__((section("sfrs"),address(0xBF82AB64)));
extern volatile uint32_t        STRIG11SET __attribute__((section("sfrs"),address(0xBF82AB68)));
extern volatile uint32_t        STRIG11INV __attribute__((section("sfrs"),address(0xBF82AB6C)));
#define CAP11 CAP11
extern volatile uint32_t   CAP11 __attribute__((section("sfrs"), address(0xBF82AB70)));
typedef struct {
  uint32_t CAP:16;
} __CAP11bits_t;
extern volatile __CAP11bits_t CAP11bits __asm__ ("CAP11") __attribute__((section("sfrs"), address(0xBF82AB70)));
extern volatile uint32_t        CAP11CLR __attribute__((section("sfrs"),address(0xBF82AB74)));
extern volatile uint32_t        CAP11SET __attribute__((section("sfrs"),address(0xBF82AB78)));
extern volatile uint32_t        CAP11INV __attribute__((section("sfrs"),address(0xBF82AB7C)));
#define LEBCON11 LEBCON11
extern volatile uint32_t   LEBCON11 __attribute__((section("sfrs"), address(0xBF82AB80)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON11bits_t;
extern volatile __LEBCON11bits_t LEBCON11bits __asm__ ("LEBCON11") __attribute__((section("sfrs"), address(0xBF82AB80)));
extern volatile uint32_t        LEBCON11CLR __attribute__((section("sfrs"),address(0xBF82AB84)));
extern volatile uint32_t        LEBCON11SET __attribute__((section("sfrs"),address(0xBF82AB88)));
extern volatile uint32_t        LEBCON11INV __attribute__((section("sfrs"),address(0xBF82AB8C)));
#define LEBDLY11 LEBDLY11
extern volatile uint32_t   LEBDLY11 __attribute__((section("sfrs"), address(0xBF82AB90)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY11bits_t;
extern volatile __LEBDLY11bits_t LEBDLY11bits __asm__ ("LEBDLY11") __attribute__((section("sfrs"), address(0xBF82AB90)));
extern volatile uint32_t        LEBDLY11CLR __attribute__((section("sfrs"),address(0xBF82AB94)));
extern volatile uint32_t        LEBDLY11SET __attribute__((section("sfrs"),address(0xBF82AB98)));
extern volatile uint32_t        LEBDLY11INV __attribute__((section("sfrs"),address(0xBF82AB9C)));
#define AUXCON11 AUXCON11
extern volatile uint32_t   AUXCON11 __attribute__((section("sfrs"), address(0xBF82ABA0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON11bits_t;
extern volatile __AUXCON11bits_t AUXCON11bits __asm__ ("AUXCON11") __attribute__((section("sfrs"), address(0xBF82ABA0)));
extern volatile uint32_t        AUXCON11CLR __attribute__((section("sfrs"),address(0xBF82ABA4)));
extern volatile uint32_t        AUXCON11SET __attribute__((section("sfrs"),address(0xBF82ABA8)));
extern volatile uint32_t        AUXCON11INV __attribute__((section("sfrs"),address(0xBF82ABAC)));
#define PTMR11 PTMR11
extern volatile uint32_t   PTMR11 __attribute__((section("sfrs"), address(0xBF82ABB0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR11bits_t;
extern volatile __PTMR11bits_t PTMR11bits __asm__ ("PTMR11") __attribute__((section("sfrs"), address(0xBF82ABB0)));
extern volatile uint32_t        PTMR11CLR __attribute__((section("sfrs"),address(0xBF82ABB4)));
extern volatile uint32_t        PTMR11SET __attribute__((section("sfrs"),address(0xBF82ABB8)));
extern volatile uint32_t        PTMR11INV __attribute__((section("sfrs"),address(0xBF82ABBC)));
#define PWMCON12 PWMCON12
extern volatile uint32_t   PWMCON12 __attribute__((section("sfrs"), address(0xBF82ABC0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON12bits_t;
