Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
extern volatile __QEI3ICCbits_t QEI3ICCbits __asm__ ("QEI3ICC") __attribute__((section("sfrs"), address(0xBF82B6B0)));
extern volatile uint32_t        QEI3ICCCLR __attribute__((section("sfrs"),address(0xBF82B6B4)));
extern volatile uint32_t        QEI3ICCSET __attribute__((section("sfrs"),address(0xBF82B6B8)));
extern volatile uint32_t        QEI3ICCINV __attribute__((section("sfrs"),address(0xBF82B6BC)));
#define QEI3CMPL QEI3CMPL
extern volatile uint32_t   QEI3CMPL __attribute__((section("sfrs"), address(0xBF82B6C0)));
typedef struct {
  uint32_t QEICMPL:32;
} __QEI3CMPLbits_t;
extern volatile __QEI3CMPLbits_t QEI3CMPLbits __asm__ ("QEI3CMPL") __attribute__((section("sfrs"), address(0xBF82B6C0)));
extern volatile uint32_t        QEI3CMPLCLR __attribute__((section("sfrs"),address(0xBF82B6C4)));
extern volatile uint32_t        QEI3CMPLSET __attribute__((section("sfrs"),address(0xBF82B6C8)));
extern volatile uint32_t        QEI3CMPLINV __attribute__((section("sfrs"),address(0xBF82B6CC)));
#define QEI4CON QEI4CON
extern volatile uint32_t   QEI4CON __attribute__((section("sfrs"), address(0xBF82B800)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI4CONbits_t;
extern volatile __QEI4CONbits_t QEI4CONbits __asm__ ("QEI4CON") __attribute__((section("sfrs"), address(0xBF82B800)));
extern volatile uint32_t        QEI4CONCLR __attribute__((section("sfrs"),address(0xBF82B804)));
extern volatile uint32_t        QEI4CONSET __attribute__((section("sfrs"),address(0xBF82B808)));
extern volatile uint32_t        QEI4CONINV __attribute__((section("sfrs"),address(0xBF82B80C)));
#define QEI4IOC QEI4IOC
extern volatile uint32_t   QEI4IOC __attribute__((section("sfrs"), address(0xBF82B810)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI4IOCbits_t;
extern volatile __QEI4IOCbits_t QEI4IOCbits __asm__ ("QEI4IOC") __attribute__((section("sfrs"), address(0xBF82B810)));
extern volatile uint32_t        QEI4IOCCLR __attribute__((section("sfrs"),address(0xBF82B814)));
extern volatile uint32_t        QEI4IOCSET __attribute__((section("sfrs"),address(0xBF82B818)));
extern volatile uint32_t        QEI4IOCINV __attribute__((section("sfrs"),address(0xBF82B81C)));
#define QEI4STAT QEI4STAT
extern volatile uint32_t   QEI4STAT __attribute__((section("sfrs"), address(0xBF82B820)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI4STATbits_t;
extern volatile __QEI4STATbits_t QEI4STATbits __asm__ ("QEI4STAT") __attribute__((section("sfrs"), address(0xBF82B820)));
extern volatile uint32_t        QEI4STATCLR __attribute__((section("sfrs"),address(0xBF82B824)));
extern volatile uint32_t        QEI4STATSET __attribute__((section("sfrs"),address(0xBF82B828)));
extern volatile uint32_t        QEI4STATINV __attribute__((section("sfrs"),address(0xBF82B82C)));
#define POS4CNT POS4CNT
extern volatile uint32_t   POS4CNT __attribute__((section("sfrs"), address(0xBF82B830)));
typedef struct {
  uint32_t POSCNT:32;
} __POS4CNTbits_t;
extern volatile __POS4CNTbits_t POS4CNTbits __asm__ ("POS4CNT") __attribute__((section("sfrs"), address(0xBF82B830)));
extern volatile uint32_t        POS4CNTCLR __attribute__((section("sfrs"),address(0xBF82B834)));
extern volatile uint32_t        POS4CNTSET __attribute__((section("sfrs"),address(0xBF82B838)));
extern volatile uint32_t        POS4CNTINV __attribute__((section("sfrs"),address(0xBF82B83C)));
#define POS4HLD POS4HLD
extern volatile uint32_t   POS4HLD __attribute__((section("sfrs"), address(0xBF82B840)));
typedef struct {
  uint32_t POSHLD:32;
} __POS4HLDbits_t;
extern volatile __POS4HLDbits_t POS4HLDbits __asm__ ("POS4HLD") __attribute__((section("sfrs"), address(0xBF82B840)));
extern volatile uint32_t        POS4HLDCLR __attribute__((section("sfrs"),address(0xBF82B844)));
extern volatile uint32_t        POS4HLDSET __attribute__((section("sfrs"),address(0xBF82B848)));
extern volatile uint32_t        POS4HLDINV __attribute__((section("sfrs"),address(0xBF82B84C)));
#define VEL4CNT VEL4CNT
extern volatile uint32_t   VEL4CNT __attribute__((section("sfrs"), address(0xBF82B850)));
typedef struct {
  uint32_t VELCNT:32;
} __VEL4CNTbits_t;
extern volatile __VEL4CNTbits_t VEL4CNTbits __asm__ ("VEL4CNT") __attribute__((section("sfrs"), address(0xBF82B850)));
extern volatile uint32_t        VEL4CNTCLR __attribute__((section("sfrs"),address(0xBF82B854)));
extern volatile uint32_t        VEL4CNTSET __attribute__((section("sfrs"),address(0xBF82B858)));
extern volatile uint32_t        VEL4CNTINV __attribute__((section("sfrs"),address(0xBF82B85C)));
#define VEL4HLD VEL4HLD
extern volatile uint32_t   VEL4HLD __attribute__((section("sfrs"), address(0xBF82B860)));
typedef struct {
  uint32_t VELHLD:32;
} __VEL4HLDbits_t;
extern volatile __VEL4HLDbits_t VEL4HLDbits __asm__ ("VEL4HLD") __attribute__((section("sfrs"), address(0xBF82B860)));
extern volatile uint32_t        VEL4HLDCLR __attribute__((section("sfrs"),address(0xBF82B864)));
extern volatile uint32_t        VEL4HLDSET __attribute__((section("sfrs"),address(0xBF82B868)));
extern volatile uint32_t        VEL4HLDINV __attribute__((section("sfrs"),address(0xBF82B86C)));
#define INT4TMR INT4TMR
extern volatile uint32_t   INT4TMR __attribute__((section("sfrs"), address(0xBF82B870)));
typedef struct {
  uint32_t INTTMR:32;
} __INT4TMRbits_t;
extern volatile __INT4TMRbits_t INT4TMRbits __asm__ ("INT4TMR") __attribute__((section("sfrs"), address(0xBF82B870)));
extern volatile uint32_t        INT4TMRCLR __attribute__((section("sfrs"),address(0xBF82B874)));
extern volatile uint32_t        INT4TMRSET __attribute__((section("sfrs"),address(0xBF82B878)));
extern volatile uint32_t        INT4TMRINV __attribute__((section("sfrs"),address(0xBF82B87C)));
#define INT4HLD INT4HLD
extern volatile uint32_t   INT4HLD __attribute__((section("sfrs"), address(0xBF82B880)));
typedef struct {
  uint32_t INTHLD:32;
} __INT4HLDbits_t;
extern volatile __INT4HLDbits_t INT4HLDbits __asm__ ("INT4HLD") __attribute__((section("sfrs"), address(0xBF82B880)));
extern volatile uint32_t        INT4HLDCLR __attribute__((section("sfrs"),address(0xBF82B884)));
extern volatile uint32_t        INT4HLDSET __attribute__((section("sfrs"),address(0xBF82B888)));
extern volatile uint32_t        INT4HLDINV __attribute__((section("sfrs"),address(0xBF82B88C)));
#define INDX4CNT INDX4CNT
extern volatile uint32_t   INDX4CNT __attribute__((section("sfrs"), address(0xBF82B890)));
typedef struct {
  uint32_t INDXCNT:32;
} __INDX4CNTbits_t;
extern volatile __INDX4CNTbits_t INDX4CNTbits __asm__ ("INDX4CNT") __attribute__((section("sfrs"), address(0xBF82B890)));
extern volatile uint32_t        INDX4CNTCLR __attribute__((section("sfrs"),address(0xBF82B894)));
extern volatile uint32_t        INDX4CNTSET __attribute__((section("sfrs"),address(0xBF82B898)));
extern volatile uint32_t        INDX4CNTINV __attribute__((section("sfrs"),address(0xBF82B89C)));
#define INDX4HLD INDX4HLD
extern volatile uint32_t   INDX4HLD __attribute__((section("sfrs"), address(0xBF82B8A0)));
typedef struct {
  uint32_t INDXHLD:32;
} __INDX4HLDbits_t;
