Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
extern volatile __C3CONbits_t C3CONbits __asm__ ("C3CON") __attribute__((section("sfrs"), address(0xBF884000)));
extern volatile uint32_t        C3CONCLR __attribute__((section("sfrs"),address(0xBF884004)));
extern volatile uint32_t        C3CONSET __attribute__((section("sfrs"),address(0xBF884008)));
extern volatile uint32_t        C3CONINV __attribute__((section("sfrs"),address(0xBF88400C)));
#define C3CFG C3CFG
extern volatile uint32_t   C3CFG __attribute__((section("sfrs"), address(0xBF884010)));
typedef union {
  struct {
    uint32_t BRP:6;
    uint32_t SJW:2;
    uint32_t PRSEG:3;
    uint32_t SEG1PH:3;
    uint32_t SAM:1;
    uint32_t SEG2PHTS:1;
    uint32_t SEG2PH:3;
    uint32_t :3;
    uint32_t WAKFIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3CFGbits_t;
extern volatile __C3CFGbits_t C3CFGbits __asm__ ("C3CFG") __attribute__((section("sfrs"), address(0xBF884010)));
extern volatile uint32_t        C3CFGCLR __attribute__((section("sfrs"),address(0xBF884014)));
extern volatile uint32_t        C3CFGSET __attribute__((section("sfrs"),address(0xBF884018)));
extern volatile uint32_t        C3CFGINV __attribute__((section("sfrs"),address(0xBF88401C)));
#define C3INT C3INT
extern volatile uint32_t   C3INT __attribute__((section("sfrs"), address(0xBF884020)));
typedef union {
  struct {
    uint32_t TBIF:1;
    uint32_t RBIF:1;
    uint32_t CTMRIF:1;
    uint32_t MODIF:1;
    uint32_t :7;
    uint32_t RBOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVRIF:1;
    uint32_t TBIE:1;
    uint32_t RBIE:1;
    uint32_t CTMRIE:1;
    uint32_t MODIE:1;
    uint32_t :7;
    uint32_t RBOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVRIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3INTbits_t;
extern volatile __C3INTbits_t C3INTbits __asm__ ("C3INT") __attribute__((section("sfrs"), address(0xBF884020)));
extern volatile uint32_t        C3INTCLR __attribute__((section("sfrs"),address(0xBF884024)));
extern volatile uint32_t        C3INTSET __attribute__((section("sfrs"),address(0xBF884028)));
extern volatile uint32_t        C3INTINV __attribute__((section("sfrs"),address(0xBF88402C)));
#define C3VEC C3VEC
extern volatile uint32_t   C3VEC __attribute__((section("sfrs"), address(0xBF884030)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3VECbits_t;
extern volatile __C3VECbits_t C3VECbits __asm__ ("C3VEC") __attribute__((section("sfrs"), address(0xBF884030)));
extern volatile uint32_t        C3VECCLR __attribute__((section("sfrs"),address(0xBF884034)));
extern volatile uint32_t        C3VECSET __attribute__((section("sfrs"),address(0xBF884038)));
extern volatile uint32_t        C3VECINV __attribute__((section("sfrs"),address(0xBF88403C)));
#define C3TREC C3TREC
extern volatile uint32_t   C3TREC __attribute__((section("sfrs"), address(0xBF884040)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3TRECbits_t;
extern volatile __C3TRECbits_t C3TRECbits __asm__ ("C3TREC") __attribute__((section("sfrs"), address(0xBF884040)));
extern volatile uint32_t        C3TRECCLR __attribute__((section("sfrs"),address(0xBF884044)));
extern volatile uint32_t        C3TRECSET __attribute__((section("sfrs"),address(0xBF884048)));
extern volatile uint32_t        C3TRECINV __attribute__((section("sfrs"),address(0xBF88404C)));
#define C3FSTAT C3FSTAT
extern volatile uint32_t   C3FSTAT __attribute__((section("sfrs"), address(0xBF884050)));
typedef union {
  struct {
    uint32_t FIFOIP:32;
  };
  struct {
    uint32_t FIFOIP0:1;
    uint32_t FIFOIP1:1;
    uint32_t FIFOIP2:1;
    uint32_t FIFOIP3:1;
    uint32_t FIFOIP4:1;
    uint32_t FIFOIP5:1;
    uint32_t FIFOIP6:1;
    uint32_t FIFOIP7:1;
    uint32_t FIFOIP8:1;
    uint32_t FIFOIP9:1;
    uint32_t FIFOIP10:1;
    uint32_t FIFOIP11:1;
    uint32_t FIFOIP12:1;
    uint32_t FIFOIP13:1;
    uint32_t FIFOIP14:1;
    uint32_t FIFOIP15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FSTATbits_t;
extern volatile __C3FSTATbits_t C3FSTATbits __asm__ ("C3FSTAT") __attribute__((section("sfrs"), address(0xBF884050)));
extern volatile uint32_t        C3FSTATCLR __attribute__((section("sfrs"),address(0xBF884054)));
extern volatile uint32_t        C3FSTATSET __attribute__((section("sfrs"),address(0xBF884058)));
extern volatile uint32_t        C3FSTATINV __attribute__((section("sfrs"),address(0xBF88405C)));
#define C3RXOVF C3RXOVF
extern volatile uint32_t   C3RXOVF __attribute__((section("sfrs"), address(0xBF884060)));
typedef union {
  struct {
    uint32_t RXOVF:32;
  };
  struct {
    uint32_t RXOVF0:1;
    uint32_t RXOVF1:1;
    uint32_t RXOVF2:1;
    uint32_t RXOVF3:1;
    uint32_t RXOVF4:1;
    uint32_t RXOVF5:1;
    uint32_t RXOVF6:1;
    uint32_t RXOVF7:1;
    uint32_t RXOVF8:1;
    uint32_t RXOVF9:1;
    uint32_t RXOVF10:1;
    uint32_t RXOVF11:1;
    uint32_t RXOVF12:1;
    uint32_t RXOVF13:1;
    uint32_t RXOVF14:1;
    uint32_t RXOVF15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXOVFbits_t;
extern volatile __C3RXOVFbits_t C3RXOVFbits __asm__ ("C3RXOVF") __attribute__((section("sfrs"), address(0xBF884060)));
extern volatile uint32_t        C3RXOVFCLR __attribute__((section("sfrs"),address(0xBF884064)));
extern volatile uint32_t        C3RXOVFSET __attribute__((section("sfrs"),address(0xBF884068)));
extern volatile uint32_t        C3RXOVFINV __attribute__((section("sfrs"),address(0xBF88406C)));
#define C3TMR C3TMR
extern volatile uint32_t   C3TMR __attribute__((section("sfrs"), address(0xBF884070)));
typedef union {
  struct {
    uint32_t CANTSPRE:16;
    uint32_t CANTS:16;
  };
  struct {
    uint32_t w:32;
  };
} __C3TMRbits_t;
extern volatile __C3TMRbits_t C3TMRbits __asm__ ("C3TMR") __attribute__((section("sfrs"), address(0xBF884070)));
extern volatile uint32_t        C3TMRCLR __attribute__((section("sfrs"),address(0xBF884074)));
extern volatile uint32_t        C3TMRSET __attribute__((section("sfrs"),address(0xBF884078)));
extern volatile uint32_t        C3TMRINV __attribute__((section("sfrs"),address(0xBF88407C)));
#define C3RXM0 C3RXM0
extern volatile uint32_t   C3RXM0 __attribute__((section("sfrs"), address(0xBF884080)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXM0bits_t;
extern volatile __C3RXM0bits_t C3RXM0bits __asm__ ("C3RXM0") __attribute__((section("sfrs"), address(0xBF884080)));
extern volatile uint32_t        C3RXM0CLR __attribute__((section("sfrs"),address(0xBF884084)));
extern volatile uint32_t        C3RXM0SET __attribute__((section("sfrs"),address(0xBF884088)));
extern volatile uint32_t        C3RXM0INV __attribute__((section("sfrs"),address(0xBF88408C)));
#define C3RXM1 C3RXM1
extern volatile uint32_t   C3RXM1 __attribute__((section("sfrs"), address(0xBF884090)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXM1bits_t;
extern volatile __C3RXM1bits_t C3RXM1bits __asm__ ("C3RXM1") __attribute__((section("sfrs"), address(0xBF884090)));
extern volatile uint32_t        C3RXM1CLR __attribute__((section("sfrs"),address(0xBF884094)));
extern volatile uint32_t        C3RXM1SET __attribute__((section("sfrs"),address(0xBF884098)));
extern volatile uint32_t        C3RXM1INV __attribute__((section("sfrs"),address(0xBF88409C)));
#define C3RXM2 C3RXM2
extern volatile uint32_t   C3RXM2 __attribute__((section("sfrs"), address(0xBF8840A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXM2bits_t;
extern volatile __C3RXM2bits_t C3RXM2bits __asm__ ("C3RXM2") __attribute__((section("sfrs"), address(0xBF8840A0)));
extern volatile uint32_t        C3RXM2CLR __attribute__((section("sfrs"),address(0xBF8840A4)));
extern volatile uint32_t        C3RXM2SET __attribute__((section("sfrs"),address(0xBF8840A8)));
extern volatile uint32_t        C3RXM2INV __attribute__((section("sfrs"),address(0xBF8840AC)));
#define C3RXM3 C3RXM3
extern volatile uint32_t   C3RXM3 __attribute__((section("sfrs"), address(0xBF8840B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C3RXM3bits_t;
extern volatile __C3RXM3bits_t C3RXM3bits __asm__ ("C3RXM3") __attribute__((section("sfrs"), address(0xBF8840B0)));
extern volatile uint32_t        C3RXM3CLR __attribute__((section("sfrs"),address(0xBF8840B4)));
extern volatile uint32_t        C3RXM3SET __attribute__((section("sfrs"),address(0xBF8840B8)));
extern volatile uint32_t        C3RXM3INV __attribute__((section("sfrs"),address(0xBF8840BC)));
#define C3FLTCON0 C3FLTCON0
extern volatile uint32_t   C3FLTCON0 __attribute__((section("sfrs"), address(0xBF8840C0)));
typedef union {
  struct {
    uint32_t FSEL0:5;
    uint32_t MSEL0:2;
    uint32_t FLTEN0:1;
    uint32_t FSEL1:5;
    uint32_t MSEL1:2;
    uint32_t FLTEN1:1;
    uint32_t FSEL2:5;
    uint32_t MSEL2:2;
    uint32_t FLTEN2:1;
    uint32_t FSEL3:5;
    uint32_t MSEL3:2;
    uint32_t FLTEN3:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FLTCON0bits_t;
