Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
extern volatile __U2EP4bits_t U2EP4bits __asm__ ("U2EP4") __attribute__((section("sfrs"), address(0xBF88A340)));
extern volatile uint32_t        U2EP4CLR __attribute__((section("sfrs"),address(0xBF88A344)));
extern volatile uint32_t        U2EP4SET __attribute__((section("sfrs"),address(0xBF88A348)));
extern volatile uint32_t        U2EP4INV __attribute__((section("sfrs"),address(0xBF88A34C)));
#define U2EP5 U2EP5
extern volatile uint32_t   U2EP5 __attribute__((section("sfrs"), address(0xBF88A350)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP5bits_t;
extern volatile __U2EP5bits_t U2EP5bits __asm__ ("U2EP5") __attribute__((section("sfrs"), address(0xBF88A350)));
extern volatile uint32_t        U2EP5CLR __attribute__((section("sfrs"),address(0xBF88A354)));
extern volatile uint32_t        U2EP5SET __attribute__((section("sfrs"),address(0xBF88A358)));
extern volatile uint32_t        U2EP5INV __attribute__((section("sfrs"),address(0xBF88A35C)));
#define U2EP6 U2EP6
extern volatile uint32_t   U2EP6 __attribute__((section("sfrs"), address(0xBF88A360)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP6bits_t;
extern volatile __U2EP6bits_t U2EP6bits __asm__ ("U2EP6") __attribute__((section("sfrs"), address(0xBF88A360)));
extern volatile uint32_t        U2EP6CLR __attribute__((section("sfrs"),address(0xBF88A364)));
extern volatile uint32_t        U2EP6SET __attribute__((section("sfrs"),address(0xBF88A368)));
extern volatile uint32_t        U2EP6INV __attribute__((section("sfrs"),address(0xBF88A36C)));
#define U2EP7 U2EP7
extern volatile uint32_t   U2EP7 __attribute__((section("sfrs"), address(0xBF88A370)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP7bits_t;
extern volatile __U2EP7bits_t U2EP7bits __asm__ ("U2EP7") __attribute__((section("sfrs"), address(0xBF88A370)));
extern volatile uint32_t        U2EP7CLR __attribute__((section("sfrs"),address(0xBF88A374)));
extern volatile uint32_t        U2EP7SET __attribute__((section("sfrs"),address(0xBF88A378)));
extern volatile uint32_t        U2EP7INV __attribute__((section("sfrs"),address(0xBF88A37C)));
#define U2EP8 U2EP8
extern volatile uint32_t   U2EP8 __attribute__((section("sfrs"), address(0xBF88A380)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP8bits_t;
extern volatile __U2EP8bits_t U2EP8bits __asm__ ("U2EP8") __attribute__((section("sfrs"), address(0xBF88A380)));
extern volatile uint32_t        U2EP8CLR __attribute__((section("sfrs"),address(0xBF88A384)));
extern volatile uint32_t        U2EP8SET __attribute__((section("sfrs"),address(0xBF88A388)));
extern volatile uint32_t        U2EP8INV __attribute__((section("sfrs"),address(0xBF88A38C)));
#define U2EP9 U2EP9
extern volatile uint32_t   U2EP9 __attribute__((section("sfrs"), address(0xBF88A390)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP9bits_t;
extern volatile __U2EP9bits_t U2EP9bits __asm__ ("U2EP9") __attribute__((section("sfrs"), address(0xBF88A390)));
extern volatile uint32_t        U2EP9CLR __attribute__((section("sfrs"),address(0xBF88A394)));
extern volatile uint32_t        U2EP9SET __attribute__((section("sfrs"),address(0xBF88A398)));
extern volatile uint32_t        U2EP9INV __attribute__((section("sfrs"),address(0xBF88A39C)));
#define U2EP10 U2EP10
extern volatile uint32_t   U2EP10 __attribute__((section("sfrs"), address(0xBF88A3A0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP10bits_t;
extern volatile __U2EP10bits_t U2EP10bits __asm__ ("U2EP10") __attribute__((section("sfrs"), address(0xBF88A3A0)));
extern volatile uint32_t        U2EP10CLR __attribute__((section("sfrs"),address(0xBF88A3A4)));
extern volatile uint32_t        U2EP10SET __attribute__((section("sfrs"),address(0xBF88A3A8)));
extern volatile uint32_t        U2EP10INV __attribute__((section("sfrs"),address(0xBF88A3AC)));
#define U2EP11 U2EP11
extern volatile uint32_t   U2EP11 __attribute__((section("sfrs"), address(0xBF88A3B0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP11bits_t;
extern volatile __U2EP11bits_t U2EP11bits __asm__ ("U2EP11") __attribute__((section("sfrs"), address(0xBF88A3B0)));
extern volatile uint32_t        U2EP11CLR __attribute__((section("sfrs"),address(0xBF88A3B4)));
extern volatile uint32_t        U2EP11SET __attribute__((section("sfrs"),address(0xBF88A3B8)));
extern volatile uint32_t        U2EP11INV __attribute__((section("sfrs"),address(0xBF88A3BC)));
#define U2EP12 U2EP12
extern volatile uint32_t   U2EP12 __attribute__((section("sfrs"), address(0xBF88A3C0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP12bits_t;
extern volatile __U2EP12bits_t U2EP12bits __asm__ ("U2EP12") __attribute__((section("sfrs"), address(0xBF88A3C0)));
extern volatile uint32_t        U2EP12CLR __attribute__((section("sfrs"),address(0xBF88A3C4)));
extern volatile uint32_t        U2EP12SET __attribute__((section("sfrs"),address(0xBF88A3C8)));
extern volatile uint32_t        U2EP12INV __attribute__((section("sfrs"),address(0xBF88A3CC)));
#define U2EP13 U2EP13
extern volatile uint32_t   U2EP13 __attribute__((section("sfrs"), address(0xBF88A3D0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP13bits_t;
extern volatile __U2EP13bits_t U2EP13bits __asm__ ("U2EP13") __attribute__((section("sfrs"), address(0xBF88A3D0)));
extern volatile uint32_t        U2EP13CLR __attribute__((section("sfrs"),address(0xBF88A3D4)));
extern volatile uint32_t        U2EP13SET __attribute__((section("sfrs"),address(0xBF88A3D8)));
extern volatile uint32_t        U2EP13INV __attribute__((section("sfrs"),address(0xBF88A3DC)));
#define U2EP14 U2EP14
extern volatile uint32_t   U2EP14 __attribute__((section("sfrs"), address(0xBF88A3E0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U2EP14bits_t;
