Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
  .extern OC16RSCLR        /* 0xBF845E24 */
  .extern OC16RSSET        /* 0xBF845E28 */
  .extern OC16RSINV        /* 0xBF845E2C */
  .extern I2C3CON          /* 0xBF846400 */
  .extern I2C3CONCLR       /* 0xBF846404 */
  .extern I2C3CONSET       /* 0xBF846408 */
  .extern I2C3CONINV       /* 0xBF84640C */
  .extern I2C3STAT         /* 0xBF846410 */
  .extern I2C3STATCLR      /* 0xBF846414 */
  .extern I2C3STATSET      /* 0xBF846418 */
  .extern I2C3STATINV      /* 0xBF84641C */
  .extern I2C3ADD          /* 0xBF846420 */
  .extern I2C3ADDCLR       /* 0xBF846424 */
  .extern I2C3ADDSET       /* 0xBF846428 */
  .extern I2C3ADDINV       /* 0xBF84642C */
  .extern I2C3MSK          /* 0xBF846430 */
  .extern I2C3MSKCLR       /* 0xBF846434 */
  .extern I2C3MSKSET       /* 0xBF846438 */
  .extern I2C3MSKINV       /* 0xBF84643C */
  .extern I2C3BRG          /* 0xBF846440 */
  .extern I2C3BRGCLR       /* 0xBF846444 */
  .extern I2C3BRGSET       /* 0xBF846448 */
  .extern I2C3BRGINV       /* 0xBF84644C */
  .extern I2C3TRN          /* 0xBF846450 */
  .extern I2C3TRNCLR       /* 0xBF846454 */
  .extern I2C3TRNSET       /* 0xBF846458 */
  .extern I2C3TRNINV       /* 0xBF84645C */
  .extern I2C3RCV          /* 0xBF846460 */
  .extern I2C3RCVCLR       /* 0xBF846464 */
  .extern I2C3RCVSET       /* 0xBF846468 */
  .extern I2C3RCVINV       /* 0xBF84646C */
  .extern I2C4CON          /* 0xBF846600 */
  .extern I2C4CONCLR       /* 0xBF846604 */
  .extern I2C4CONSET       /* 0xBF846608 */
  .extern I2C4CONINV       /* 0xBF84660C */
  .extern I2C4STAT         /* 0xBF846610 */
  .extern I2C4STATCLR      /* 0xBF846614 */
  .extern I2C4STATSET      /* 0xBF846618 */
  .extern I2C4STATINV      /* 0xBF84661C */
  .extern I2C4ADD          /* 0xBF846620 */
  .extern I2C4ADDCLR       /* 0xBF846624 */
  .extern I2C4ADDSET       /* 0xBF846628 */
  .extern I2C4ADDINV       /* 0xBF84662C */
  .extern I2C4MSK          /* 0xBF846630 */
  .extern I2C4MSKCLR       /* 0xBF846634 */
  .extern I2C4MSKSET       /* 0xBF846638 */
  .extern I2C4MSKINV       /* 0xBF84663C */
  .extern I2C4BRG          /* 0xBF846640 */
  .extern I2C4BRGCLR       /* 0xBF846644 */
  .extern I2C4BRGSET       /* 0xBF846648 */
  .extern I2C4BRGINV       /* 0xBF84664C */
  .extern I2C4TRN          /* 0xBF846650 */
  .extern I2C4TRNCLR       /* 0xBF846654 */
  .extern I2C4TRNSET       /* 0xBF846658 */
  .extern I2C4TRNINV       /* 0xBF84665C */
  .extern I2C4RCV          /* 0xBF846660 */
  .extern I2C4RCVCLR       /* 0xBF846664 */
  .extern I2C4RCVSET       /* 0xBF846668 */
  .extern I2C4RCVINV       /* 0xBF84666C */
  .extern SPI3CON          /* 0xBF847400 */
  .extern SPI3CONCLR       /* 0xBF847404 */
  .extern SPI3CONSET       /* 0xBF847408 */
  .extern SPI3CONINV       /* 0xBF84740C */
  .extern SPI3STAT         /* 0xBF847410 */
  .extern SPI3STATCLR      /* 0xBF847414 */
  .extern SPI3STATSET      /* 0xBF847418 */
  .extern SPI3STATINV      /* 0xBF84741C */
  .extern SPI3BUF          /* 0xBF847420 */
  .extern SPI3BRG          /* 0xBF847430 */
  .extern SPI3BRGCLR       /* 0xBF847434 */
  .extern SPI3BRGSET       /* 0xBF847438 */
  .extern SPI3BRGINV       /* 0xBF84743C */
  .extern SPI3CON2         /* 0xBF847440 */
  .extern SPI3CON2CLR      /* 0xBF847444 */
  .extern SPI3CON2SET      /* 0xBF847448 */
  .extern SPI3CON2INV      /* 0xBF84744C */
  .extern SPI4CON          /* 0xBF847600 */
  .extern SPI4CONCLR       /* 0xBF847604 */
  .extern SPI4CONSET       /* 0xBF847608 */
  .extern SPI4CONINV       /* 0xBF84760C */
  .extern SPI4STAT         /* 0xBF847610 */
  .extern SPI4STATCLR      /* 0xBF847614 */
  .extern SPI4STATSET      /* 0xBF847618 */
  .extern SPI4STATINV      /* 0xBF84761C */
  .extern SPI4BUF          /* 0xBF847620 */
  .extern SPI4BRG          /* 0xBF847630 */
  .extern SPI4BRGCLR       /* 0xBF847634 */
  .extern SPI4BRGSET       /* 0xBF847638 */
  .extern SPI4BRGINV       /* 0xBF84763C */
  .extern SPI4CON2         /* 0xBF847640 */
  .extern SPI4CON2CLR      /* 0xBF847644 */
  .extern SPI4CON2SET      /* 0xBF847648 */
  .extern SPI4CON2INV      /* 0xBF84764C */
  .extern SPI5CON          /* 0xBF847800 */
  .extern SPI5CONCLR       /* 0xBF847804 */
  .extern SPI5CONSET       /* 0xBF847808 */
  .extern SPI5CONINV       /* 0xBF84780C */
  .extern SPI5STAT         /* 0xBF847810 */
  .extern SPI5STATCLR      /* 0xBF847814 */
  .extern SPI5STATSET      /* 0xBF847818 */
  .extern SPI5STATINV      /* 0xBF84781C */
  .extern SPI5BUF          /* 0xBF847820 */
  .extern SPI5BRG          /* 0xBF847830 */
  .extern SPI5BRGCLR       /* 0xBF847834 */
  .extern SPI5BRGSET       /* 0xBF847838 */
  .extern SPI5BRGINV       /* 0xBF84783C */
  .extern SPI5CON2         /* 0xBF847840 */
  .extern SPI5CON2CLR      /* 0xBF847844 */
  .extern SPI5CON2SET      /* 0xBF847848 */
  .extern SPI5CON2INV      /* 0xBF84784C */
  .extern SPI6CON          /* 0xBF847A00 */
  .extern SPI6CONCLR       /* 0xBF847A04 */
  .extern SPI6CONSET       /* 0xBF847A08 */
  .extern SPI6CONINV       /* 0xBF847A0C */
  .extern SPI6STAT         /* 0xBF847A10 */
  .extern SPI6STATCLR      /* 0xBF847A14 */
  .extern SPI6STATSET      /* 0xBF847A18 */
  .extern SPI6STATINV      /* 0xBF847A1C */
  .extern SPI6BUF          /* 0xBF847A20 */
  .extern SPI6BRG          /* 0xBF847A30 */
  .extern SPI6BRGCLR       /* 0xBF847A34 */
  .extern SPI6BRGSET       /* 0xBF847A38 */
  .extern SPI6BRGINV       /* 0xBF847A3C */
  .extern SPI6CON2         /* 0xBF847A40 */
  .extern SPI6CON2CLR      /* 0xBF847A44 */
  .extern SPI6CON2SET      /* 0xBF847A48 */
  .extern SPI6CON2INV      /* 0xBF847A4C */
  .extern U3MODE           /* 0xBF848400 */
  .extern U3MODECLR        /* 0xBF848404 */
  .extern U3MODESET        /* 0xBF848408 */
  .extern U3MODEINV        /* 0xBF84840C */
  .extern U3STA            /* 0xBF848410 */
  .extern U3STACLR         /* 0xBF848414 */
  .extern U3STASET         /* 0xBF848418 */
  .extern U3STAINV         /* 0xBF84841C */
  .extern U3TXREG          /* 0xBF848420 */
  .extern U3RXREG          /* 0xBF848430 */
  .extern U3BRG            /* 0xBF848440 */
  .extern U3BRGCLR         /* 0xBF848444 */
  .extern U3BRGSET         /* 0xBF848448 */
  .extern U3BRGINV         /* 0xBF84844C */
  .extern U4MODE           /* 0xBF848600 */
  .extern U4MODECLR        /* 0xBF848604 */
  .extern U4MODESET        /* 0xBF848608 */
  .extern U4MODEINV        /* 0xBF84860C */
  .extern U4STA            /* 0xBF848610 */
  .extern U4STACLR         /* 0xBF848614 */
  .extern U4STASET         /* 0xBF848618 */
  .extern U4STAINV         /* 0xBF84861C */
  .extern U4TXREG          /* 0xBF848620 */
  .extern U4RXREG          /* 0xBF848630 */
  .extern U4BRG            /* 0xBF848640 */
  .extern U4BRGCLR         /* 0xBF848644 */
  .extern U4BRGSET         /* 0xBF848648 */
  .extern U4BRGINV         /* 0xBF84864C */
  .extern U5MODE           /* 0xBF848800 */
  .extern U5MODECLR        /* 0xBF848804 */
  .extern U5MODESET        /* 0xBF848808 */
  .extern U5MODEINV        /* 0xBF84880C */
  .extern U5STA            /* 0xBF848810 */
  .extern U5STACLR         /* 0xBF848814 */
  .extern U5STASET         /* 0xBF848818 */
  .extern U5STAINV         /* 0xBF84881C */
  .extern U5TXREG          /* 0xBF848820 */
  .extern U5RXREG          /* 0xBF848830 */
  .extern U5BRG            /* 0xBF848840 */
  .extern U5BRGCLR         /* 0xBF848844 */
  .extern U5BRGSET         /* 0xBF848848 */
  .extern U5BRGINV         /* 0xBF84884C */
  .extern U6MODE           /* 0xBF848A00 */
  .extern U6MODECLR        /* 0xBF848A04 */
  .extern U6MODESET        /* 0xBF848A08 */
  .extern U6MODEINV        /* 0xBF848A0C */
  .extern U6STA            /* 0xBF848A10 */
  .extern U6STACLR         /* 0xBF848A14 */
  .extern U6STASET         /* 0xBF848A18 */
  .extern U6STAINV         /* 0xBF848A1C */
  .extern U6TXREG          /* 0xBF848A20 */
  .extern U6RXREG          /* 0xBF848A30 */
  .extern U6BRG            /* 0xBF848A40 */
  .extern U6BRGCLR         /* 0xBF848A44 */
  .extern U6BRGSET         /* 0xBF848A48 */
  .extern U6BRGINV         /* 0xBF848A4C */
  .extern DAC2CON          /* 0xBF84C400 */
  .extern DAC2CONCLR       /* 0xBF84C404 */
  .extern DAC2CONSET       /* 0xBF84C408 */
  .extern DAC2CONINV       /* 0xBF84C40C */
  .extern DAC3CON          /* 0xBF84C600 */
  .extern DAC3CONCLR       /* 0xBF84C604 */
  .extern DAC3CONSET       /* 0xBF84C608 */
  .extern DAC3CONINV       /* 0xBF84C60C */
  .extern ANSELA           /* 0xBF860000 */
  .extern ANSELACLR        /* 0xBF860004 */
  .extern ANSELASET        /* 0xBF860008 */
  .extern ANSELAINV        /* 0xBF86000C */
  .extern TRISA            /* 0xBF860010 */
  .extern TRISACLR         /* 0xBF860014 */
  .extern TRISASET         /* 0xBF860018 */
  .extern TRISAINV         /* 0xBF86001C */
  .extern PORTA            /* 0xBF860020 */
  .extern PORTACLR         /* 0xBF860024 */
  .extern PORTASET         /* 0xBF860028 */
  .extern PORTAINV         /* 0xBF86002C */
  .extern LATA             /* 0xBF860030 */
  .extern LATACLR          /* 0xBF860034 */
  .extern LATASET          /* 0xBF860038 */
  .extern LATAINV          /* 0xBF86003C */
  .extern ODCA             /* 0xBF860040 */
  .extern ODCACLR          /* 0xBF860044 */
  .extern ODCASET          /* 0xBF860048 */
  .extern ODCAINV          /* 0xBF86004C */
  .extern CNPUA            /* 0xBF860050 */
  .extern CNPUACLR         /* 0xBF860054 */
  .extern CNPUASET         /* 0xBF860058 */
  .extern CNPUAINV         /* 0xBF86005C */
  .extern CNPDA            /* 0xBF860060 */
  .extern CNPDACLR         /* 0xBF860064 */
  .extern CNPDASET         /* 0xBF860068 */
  .extern CNPDAINV         /* 0xBF86006C */
  .extern CNCONA           /* 0xBF860070 */
  .extern CNCONACLR        /* 0xBF860074 */
  .extern CNCONASET        /* 0xBF860078 */
  .extern CNCONAINV        /* 0xBF86007C */
  .extern CNENA            /* 0xBF860080 */
  .extern CNENACLR         /* 0xBF860084 */
  .extern CNENASET         /* 0xBF860088 */
  .extern CNENAINV         /* 0xBF86008C */
  .extern CNSTATA          /* 0xBF860090 */
  .extern CNSTATACLR       /* 0xBF860094 */
  .extern CNSTATASET       /* 0xBF860098 */
  .extern CNSTATAINV       /* 0xBF86009C */
  .extern CNNEA            /* 0xBF8600A0 */
  .extern CNNEACLR         /* 0xBF8600A4 */
  .extern CNNEASET         /* 0xBF8600A8 */
  .extern CNNEAINV         /* 0xBF8600AC */
  .extern CNFA             /* 0xBF8600B0 */
  .extern CNFACLR          /* 0xBF8600B4 */
  .extern CNFASET          /* 0xBF8600B8 */
  .extern CNFAINV          /* 0xBF8600BC */
  .extern SRCON0A          /* 0xBF8600C0 */
  .extern SRCON0ACLR       /* 0xBF8600C4 */
  .extern SRCON0ASET       /* 0xBF8600C8 */
  .extern SRCON0AINV       /* 0xBF8600CC */
  .extern SRCON1A          /* 0xBF8600D0 */
  .extern SRCON1ACLR       /* 0xBF8600D4 */
  .extern SRCON1ASET       /* 0xBF8600D8 */
  .extern SRCON1AINV       /* 0xBF8600DC */
  .extern ANSELB           /* 0xBF860100 */
  .extern ANSELBCLR        /* 0xBF860104 */
  .extern ANSELBSET        /* 0xBF860108 */
  .extern ANSELBINV        /* 0xBF86010C */
  .extern TRISB            /* 0xBF860110 */
  .extern TRISBCLR         /* 0xBF860114 */
  .extern TRISBSET         /* 0xBF860118 */
  .extern TRISBINV         /* 0xBF86011C */
  .extern PORTB            /* 0xBF860120 */
  .extern PORTBCLR         /* 0xBF860124 */
  .extern PORTBSET         /* 0xBF860128 */
  .extern PORTBINV         /* 0xBF86012C */
  .extern LATB             /* 0xBF860130 */
  .extern LATBCLR          /* 0xBF860134 */
  .extern LATBSET          /* 0xBF860138 */
  .extern LATBINV          /* 0xBF86013C */
  .extern ODCB             /* 0xBF860140 */
  .extern ODCBCLR          /* 0xBF860144 */
  .extern ODCBSET          /* 0xBF860148 */
  .extern ODCBINV          /* 0xBF86014C */
  .extern CNPUB            /* 0xBF860150 */
  .extern CNPUBCLR         /* 0xBF860154 */
  .extern CNPUBSET         /* 0xBF860158 */
  .extern CNPUBINV         /* 0xBF86015C */
  .extern CNPDB            /* 0xBF860160 */
  .extern CNPDBCLR         /* 0xBF860164 */
  .extern CNPDBSET         /* 0xBF860168 */
  .extern CNPDBINV         /* 0xBF86016C */
  .extern CNCONB           /* 0xBF860170 */
  .extern CNCONBCLR        /* 0xBF860174 */
  .extern CNCONBSET        /* 0xBF860178 */
  .extern CNCONBINV        /* 0xBF86017C */
  .extern CNENB            /* 0xBF860180 */
  .extern CNENBCLR         /* 0xBF860184 */
  .extern CNENBSET         /* 0xBF860188 */
  .extern CNENBINV         /* 0xBF86018C */
  .extern CNSTATB          /* 0xBF860190 */
  .extern CNSTATBCLR       /* 0xBF860194 */
  .extern CNSTATBSET       /* 0xBF860198 */
  .extern CNSTATBINV       /* 0xBF86019C */
  .extern CNNEB            /* 0xBF8601A0 */
  .extern CNNEBCLR         /* 0xBF8601A4 */
  .extern CNNEBSET         /* 0xBF8601A8 */
  .extern CNNEBINV         /* 0xBF8601AC */
  .extern CNFB             /* 0xBF8601B0 */
  .extern CNFBCLR          /* 0xBF8601B4 */
  .extern CNFBSET          /* 0xBF8601B8 */
  .extern CNFBINV          /* 0xBF8601BC */
  .extern SRCON0B          /* 0xBF8601C0 */
  .extern SRCON0BCLR       /* 0xBF8601C4 */
  .extern SRCON0BSET       /* 0xBF8601C8 */
  .extern SRCON0BINV       /* 0xBF8601CC */
  .extern SRCON1B          /* 0xBF8601D0 */
  .extern SRCON1BCLR       /* 0xBF8601D4 */
  .extern SRCON1BSET       /* 0xBF8601D8 */
  .extern SRCON1BINV       /* 0xBF8601DC */
  .extern ANSELC           /* 0xBF860200 */
  .extern ANSELCCLR        /* 0xBF860204 */
  .extern ANSELCSET        /* 0xBF860208 */
  .extern ANSELCINV        /* 0xBF86020C */
  .extern TRISC            /* 0xBF860210 */
  .extern TRISCCLR         /* 0xBF860214 */
  .extern TRISCSET         /* 0xBF860218 */
  .extern TRISCINV         /* 0xBF86021C */
  .extern PORTC            /* 0xBF860220 */
  .extern PORTCCLR         /* 0xBF860224 */
  .extern PORTCSET         /* 0xBF860228 */
  .extern PORTCINV         /* 0xBF86022C */
  .extern LATC             /* 0xBF860230 */
  .extern LATCCLR          /* 0xBF860234 */
  .extern LATCSET          /* 0xBF860238 */
  .extern LATCINV          /* 0xBF86023C */
  .extern ODCC             /* 0xBF860240 */
  .extern ODCCCLR          /* 0xBF860244 */
  .extern ODCCSET          /* 0xBF860248 */
  .extern ODCCINV          /* 0xBF86024C */
  .extern CNPUC            /* 0xBF860250 */
  .extern CNPUCCLR         /* 0xBF860254 */
  .extern CNPUCSET         /* 0xBF860258 */
  .extern CNPUCINV         /* 0xBF86025C */
  .extern CNPDC            /* 0xBF860260 */
  .extern CNPDCCLR         /* 0xBF860264 */
  .extern CNPDCSET         /* 0xBF860268 */
  .extern CNPDCINV         /* 0xBF86026C */
  .extern CNCONC           /* 0xBF860270 */
  .extern CNCONCCLR        /* 0xBF860274 */
  .extern CNCONCSET        /* 0xBF860278 */
  .extern CNCONCINV        /* 0xBF86027C */
  .extern CNENC            /* 0xBF860280 */
  .extern CNENCCLR         /* 0xBF860284 */
  .extern CNENCSET         /* 0xBF860288 */
  .extern CNENCINV         /* 0xBF86028C */
  .extern CNSTATC          /* 0xBF860290 */
  .extern CNSTATCCLR       /* 0xBF860294 */
  .extern CNSTATCSET       /* 0xBF860298 */
  .extern CNSTATCINV       /* 0xBF86029C */
  .extern CNNEC            /* 0xBF8602A0 */
  .extern CNNECCLR         /* 0xBF8602A4 */
  .extern CNNECSET         /* 0xBF8602A8 */
  .extern CNNECINV         /* 0xBF8602AC */
  .extern CNFC             /* 0xBF8602B0 */
  .extern CNFCCLR          /* 0xBF8602B4 */
  .extern CNFCSET          /* 0xBF8602B8 */
  .extern CNFCINV          /* 0xBF8602BC */
  .extern SRCON0C          /* 0xBF8602C0 */
  .extern SRCON0CCLR       /* 0xBF8602C4 */
  .extern SRCON0CSET       /* 0xBF8602C8 */
  .extern SRCON0CINV       /* 0xBF8602CC */
  .extern SRCON1C          /* 0xBF8602D0 */
  .extern SRCON1CCLR       /* 0xBF8602D4 */
  .extern SRCON1CSET       /* 0xBF8602D8 */
  .extern SRCON1CINV       /* 0xBF8602DC */
  .extern ANSELD           /* 0xBF860300 */
  .extern ANSELDCLR        /* 0xBF860304 */
  .extern ANSELDSET        /* 0xBF860308 */
  .extern ANSELDINV        /* 0xBF86030C */
  .extern TRISD            /* 0xBF860310 */
  .extern TRISDCLR         /* 0xBF860314 */
  .extern TRISDSET         /* 0xBF860318 */
  .extern TRISDINV         /* 0xBF86031C */
  .extern PORTD            /* 0xBF860320 */
  .extern PORTDCLR         /* 0xBF860324 */
  .extern PORTDSET         /* 0xBF860328 */
  .extern PORTDINV         /* 0xBF86032C */
  .extern LATD             /* 0xBF860330 */
  .extern LATDCLR          /* 0xBF860334 */
  .extern LATDSET          /* 0xBF860338 */
  .extern LATDINV          /* 0xBF86033C */
  .extern ODCD             /* 0xBF860340 */
  .extern ODCDCLR          /* 0xBF860344 */
  .extern ODCDSET          /* 0xBF860348 */
  .extern ODCDINV          /* 0xBF86034C */
  .extern CNPUD            /* 0xBF860350 */
  .extern CNPUDCLR         /* 0xBF860354 */
  .extern CNPUDSET         /* 0xBF860358 */
  .extern CNPUDINV         /* 0xBF86035C */
  .extern CNPDD            /* 0xBF860360 */
  .extern CNPDDCLR         /* 0xBF860364 */
  .extern CNPDDSET         /* 0xBF860368 */
  .extern CNPDDINV         /* 0xBF86036C */
  .extern CNCOND           /* 0xBF860370 */
  .extern CNCONDCLR        /* 0xBF860374 */
  .extern CNCONDSET        /* 0xBF860378 */
  .extern CNCONDINV        /* 0xBF86037C */
  .extern CNEND            /* 0xBF860380 */
  .extern CNENDCLR         /* 0xBF860384 */
  .extern CNENDSET         /* 0xBF860388 */
  .extern CNENDINV         /* 0xBF86038C */
  .extern CNSTATD          /* 0xBF860390 */
  .extern CNSTATDCLR       /* 0xBF860394 */
  .extern CNSTATDSET       /* 0xBF860398 */
  .extern CNSTATDINV       /* 0xBF86039C */
  .extern CNNED            /* 0xBF8603A0 */
  .extern CNNEDCLR         /* 0xBF8603A4 */
  .extern CNNEDSET         /* 0xBF8603A8 */
  .extern CNNEDINV         /* 0xBF8603AC */
  .extern CNFD             /* 0xBF8603B0 */
  .extern CNFDCLR          /* 0xBF8603B4 */
  .extern CNFDSET          /* 0xBF8603B8 */
  .extern CNFDINV          /* 0xBF8603BC */
  .extern SRCON0D          /* 0xBF8603C0 */
  .extern SRCON0DCLR       /* 0xBF8603C4 */
  .extern SRCON0DSET       /* 0xBF8603C8 */
  .extern SRCON0DINV       /* 0xBF8603CC */
  .extern SRCON1D          /* 0xBF8603D0 */
  .extern SRCON1DCLR       /* 0xBF8603D4 */
  .extern SRCON1DSET       /* 0xBF8603D8 */
  .extern SRCON1DINV       /* 0xBF8603DC */
  .extern ANSELE           /* 0xBF860400 */
  .extern ANSELECLR        /* 0xBF860404 */
  .extern ANSELESET        /* 0xBF860408 */
  .extern ANSELEINV        /* 0xBF86040C */
  .extern TRISE            /* 0xBF860410 */
  .extern TRISECLR         /* 0xBF860414 */
  .extern TRISESET         /* 0xBF860418 */
  .extern TRISEINV         /* 0xBF86041C */
  .extern PORTE            /* 0xBF860420 */
  .extern PORTECLR         /* 0xBF860424 */
  .extern PORTESET         /* 0xBF860428 */
  .extern PORTEINV         /* 0xBF86042C */
  .extern LATE             /* 0xBF860430 */
  .extern LATECLR          /* 0xBF860434 */
  .extern LATESET          /* 0xBF860438 */
  .extern LATEINV          /* 0xBF86043C */
  .extern ODCE             /* 0xBF860440 */
  .extern ODCECLR          /* 0xBF860444 */
  .extern ODCESET          /* 0xBF860448 */
  .extern ODCEINV          /* 0xBF86044C */
  .extern CNPUE            /* 0xBF860450 */
  .extern CNPUECLR         /* 0xBF860454 */
  .extern CNPUESET         /* 0xBF860458 */
  .extern CNPUEINV         /* 0xBF86045C */
  .extern CNPDE            /* 0xBF860460 */
  .extern CNPDECLR         /* 0xBF860464 */
  .extern CNPDESET         /* 0xBF860468 */
  .extern CNPDEINV         /* 0xBF86046C */
  .extern CNCONE           /* 0xBF860470 */
  .extern CNCONECLR        /* 0xBF860474 */
  .extern CNCONESET        /* 0xBF860478 */
  .extern CNCONEINV        /* 0xBF86047C */
  .extern CNENE            /* 0xBF860480 */
  .extern CNENECLR         /* 0xBF860484 */
  .extern CNENESET         /* 0xBF860488 */
  .extern CNENEINV         /* 0xBF86048C */
  .extern CNSTATE          /* 0xBF860490 */
  .extern CNSTATECLR       /* 0xBF860494 */
  .extern CNSTATESET       /* 0xBF860498 */
  .extern CNSTATEINV       /* 0xBF86049C */
  .extern CNNEE            /* 0xBF8604A0 */
  .extern CNNEECLR         /* 0xBF8604A4 */
  .extern CNNEESET         /* 0xBF8604A8 */
  .extern CNNEEINV         /* 0xBF8604AC */
  .extern CNFE             /* 0xBF8604B0 */
  .extern CNFECLR          /* 0xBF8604B4 */
  .extern CNFESET          /* 0xBF8604B8 */
  .extern CNFEINV          /* 0xBF8604BC */
  .extern SRCON0E          /* 0xBF8604C0 */
  .extern SRCON0ECLR       /* 0xBF8604C4 */
  .extern SRCON0ESET       /* 0xBF8604C8 */
  .extern SRCON0EINV       /* 0xBF8604CC */
  .extern SRCON1E          /* 0xBF8604D0 */
  .extern SRCON1ECLR       /* 0xBF8604D4 */
  .extern SRCON1ESET       /* 0xBF8604D8 */
  .extern SRCON1EINV       /* 0xBF8604DC */
  .extern ANSELF           /* 0xBF860500 */
  .extern ANSELFCLR        /* 0xBF860504 */
  .extern ANSELFSET        /* 0xBF860508 */
  .extern ANSELFINV        /* 0xBF86050C */
  .extern TRISF            /* 0xBF860510 */
  .extern TRISFCLR         /* 0xBF860514 */
  .extern TRISFSET         /* 0xBF860518 */
  .extern TRISFINV         /* 0xBF86051C */
  .extern PORTF            /* 0xBF860520 */
  .extern PORTFCLR         /* 0xBF860524 */
  .extern PORTFSET         /* 0xBF860528 */
  .extern PORTFINV         /* 0xBF86052C */
  .extern LATF             /* 0xBF860530 */
  .extern LATFCLR          /* 0xBF860534 */
  .extern LATFSET          /* 0xBF860538 */
  .extern LATFINV          /* 0xBF86053C */
  .extern ODCF             /* 0xBF860540 */
  .extern ODCFCLR          /* 0xBF860544 */
  .extern ODCFSET          /* 0xBF860548 */
  .extern ODCFINV          /* 0xBF86054C */
  .extern CNPUF            /* 0xBF860550 */
  .extern CNPUFCLR         /* 0xBF860554 */
  .extern CNPUFSET         /* 0xBF860558 */
  .extern CNPUFINV         /* 0xBF86055C */
  .extern CNPDF            /* 0xBF860560 */
  .extern CNPDFCLR         /* 0xBF860564 */
  .extern CNPDFSET         /* 0xBF860568 */
  .extern CNPDFINV         /* 0xBF86056C */
  .extern CNCONF           /* 0xBF860570 */
  .extern CNCONFCLR        /* 0xBF860574 */
  .extern CNCONFSET        /* 0xBF860578 */
  .extern CNCONFINV        /* 0xBF86057C */
  .extern CNENF            /* 0xBF860580 */
  .extern CNENFCLR         /* 0xBF860584 */
  .extern CNENFSET         /* 0xBF860588 */
  .extern CNENFINV         /* 0xBF86058C */
  .extern CNSTATF          /* 0xBF860590 */
  .extern CNSTATFCLR       /* 0xBF860594 */
  .extern CNSTATFSET       /* 0xBF860598 */
  .extern CNSTATFINV       /* 0xBF86059C */
  .extern CNNEF            /* 0xBF8605A0 */
  .extern CNNEFCLR         /* 0xBF8605A4 */
  .extern CNNEFSET         /* 0xBF8605A8 */
  .extern CNNEFINV         /* 0xBF8605AC */
  .extern CNFF             /* 0xBF8605B0 */
  .extern CNFFCLR          /* 0xBF8605B4 */
  .extern CNFFSET          /* 0xBF8605B8 */
  .extern CNFFINV          /* 0xBF8605BC */
  .extern SRCON0F          /* 0xBF8605C0 */
  .extern SRCON0FCLR       /* 0xBF8605C4 */
  .extern SRCON0FSET       /* 0xBF8605C8 */
  .extern SRCON0FINV       /* 0xBF8605CC */
  .extern SRCON1F          /* 0xBF8605D0 */
  .extern SRCON1FCLR       /* 0xBF8605D4 */
  .extern SRCON1FSET       /* 0xBF8605D8 */
  .extern SRCON1FINV       /* 0xBF8605DC */
  .extern ANSELG           /* 0xBF860600 */
  .extern ANSELGCLR        /* 0xBF860604 */
  .extern ANSELGSET        /* 0xBF860608 */
  .extern ANSELGINV        /* 0xBF86060C */
  .extern TRISG            /* 0xBF860610 */
  .extern TRISGCLR         /* 0xBF860614 */
  .extern TRISGSET         /* 0xBF860618 */
  .extern TRISGINV         /* 0xBF86061C */
  .extern PORTG            /* 0xBF860620 */
  .extern PORTGCLR         /* 0xBF860624 */
  .extern PORTGSET         /* 0xBF860628 */
  .extern PORTGINV         /* 0xBF86062C */
  .extern LATG             /* 0xBF860630 */
  .extern LATGCLR          /* 0xBF860634 */
  .extern LATGSET          /* 0xBF860638 */
  .extern LATGINV          /* 0xBF86063C */
  .extern ODCG             /* 0xBF860640 */
  .extern ODCGCLR          /* 0xBF860644 */
