Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
  .extern U2FRML           /* 0xBF88A280 */
  .extern U2FRMH           /* 0xBF88A290 */
  .extern U2TOK            /* 0xBF88A2A0 */
  .extern U2TOKCLR         /* 0xBF88A2A4 */
  .extern U2TOKSET         /* 0xBF88A2A8 */
  .extern U2TOKINV         /* 0xBF88A2AC */
  .extern U2SOF            /* 0xBF88A2B0 */
  .extern U2SOFCLR         /* 0xBF88A2B4 */
  .extern U2SOFSET         /* 0xBF88A2B8 */
  .extern U2SOFINV         /* 0xBF88A2BC */
  .extern U2BDTP2          /* 0xBF88A2C0 */
  .extern U2BDTP2CLR       /* 0xBF88A2C4 */
  .extern U2BDTP2SET       /* 0xBF88A2C8 */
  .extern U2BDTP2INV       /* 0xBF88A2CC */
  .extern U2BDTP3          /* 0xBF88A2D0 */
  .extern U2BDTP3CLR       /* 0xBF88A2D4 */
  .extern U2BDTP3SET       /* 0xBF88A2D8 */
  .extern U2BDTP3INV       /* 0xBF88A2DC */
  .extern U2CNFG1          /* 0xBF88A2E0 */
  .extern U2CNFG1CLR       /* 0xBF88A2E4 */
  .extern U2CNFG1SET       /* 0xBF88A2E8 */
  .extern U2CNFG1INV       /* 0xBF88A2EC */
  .extern U2EP0            /* 0xBF88A300 */
  .extern U2EP0CLR         /* 0xBF88A304 */
  .extern U2EP0SET         /* 0xBF88A308 */
  .extern U2EP0INV         /* 0xBF88A30C */
  .extern U2EP1            /* 0xBF88A310 */
  .extern U2EP1CLR         /* 0xBF88A314 */
  .extern U2EP1SET         /* 0xBF88A318 */
  .extern U2EP1INV         /* 0xBF88A31C */
  .extern U2EP2            /* 0xBF88A320 */
  .extern U2EP2CLR         /* 0xBF88A324 */
  .extern U2EP2SET         /* 0xBF88A328 */
  .extern U2EP2INV         /* 0xBF88A32C */
  .extern U2EP3            /* 0xBF88A330 */
  .extern U2EP3CLR         /* 0xBF88A334 */
  .extern U2EP3SET         /* 0xBF88A338 */
  .extern U2EP3INV         /* 0xBF88A33C */
  .extern U2EP4            /* 0xBF88A340 */
  .extern U2EP4CLR         /* 0xBF88A344 */
  .extern U2EP4SET         /* 0xBF88A348 */
  .extern U2EP4INV         /* 0xBF88A34C */
  .extern U2EP5            /* 0xBF88A350 */
  .extern U2EP5CLR         /* 0xBF88A354 */
  .extern U2EP5SET         /* 0xBF88A358 */
  .extern U2EP5INV         /* 0xBF88A35C */
  .extern U2EP6            /* 0xBF88A360 */
  .extern U2EP6CLR         /* 0xBF88A364 */
  .extern U2EP6SET         /* 0xBF88A368 */
  .extern U2EP6INV         /* 0xBF88A36C */
  .extern U2EP7            /* 0xBF88A370 */
  .extern U2EP7CLR         /* 0xBF88A374 */
  .extern U2EP7SET         /* 0xBF88A378 */
  .extern U2EP7INV         /* 0xBF88A37C */
  .extern U2EP8            /* 0xBF88A380 */
  .extern U2EP8CLR         /* 0xBF88A384 */
  .extern U2EP8SET         /* 0xBF88A388 */
  .extern U2EP8INV         /* 0xBF88A38C */
  .extern U2EP9            /* 0xBF88A390 */
  .extern U2EP9CLR         /* 0xBF88A394 */
  .extern U2EP9SET         /* 0xBF88A398 */
  .extern U2EP9INV         /* 0xBF88A39C */
  .extern U2EP10           /* 0xBF88A3A0 */
  .extern U2EP10CLR        /* 0xBF88A3A4 */
  .extern U2EP10SET        /* 0xBF88A3A8 */
  .extern U2EP10INV        /* 0xBF88A3AC */
  .extern U2EP11           /* 0xBF88A3B0 */
  .extern U2EP11CLR        /* 0xBF88A3B4 */
  .extern U2EP11SET        /* 0xBF88A3B8 */
  .extern U2EP11INV        /* 0xBF88A3BC */
  .extern U2EP12           /* 0xBF88A3C0 */
  .extern U2EP12CLR        /* 0xBF88A3C4 */
  .extern U2EP12SET        /* 0xBF88A3C8 */
  .extern U2EP12INV        /* 0xBF88A3CC */
  .extern U2EP13           /* 0xBF88A3D0 */
  .extern U2EP13CLR        /* 0xBF88A3D4 */
  .extern U2EP13SET        /* 0xBF88A3D8 */
  .extern U2EP13INV        /* 0xBF88A3DC */
  .extern U2EP14           /* 0xBF88A3E0 */
  .extern U2EP14CLR        /* 0xBF88A3E4 */
  .extern U2EP14SET        /* 0xBF88A3E8 */
  .extern U2EP14INV        /* 0xBF88A3EC */
  .extern U2EP15           /* 0xBF88A3F0 */
  .extern U2EP15CLR        /* 0xBF88A3F4 */
  .extern U2EP15SET        /* 0xBF88A3F8 */
  .extern U2EP15INV        /* 0xBF88A3FC */
  .extern RTCCON           /* 0xBF8C0000 */
  .extern RTCCONCLR        /* 0xBF8C0004 */
  .extern RTCCONSET        /* 0xBF8C0008 */
  .extern RTCCONINV        /* 0xBF8C000C */
  .extern RTCALRM          /* 0xBF8C0010 */
  .extern RTCALRMCLR       /* 0xBF8C0014 */
  .extern RTCALRMSET       /* 0xBF8C0018 */
  .extern RTCALRMINV       /* 0xBF8C001C */
  .extern RTCTIME          /* 0xBF8C0020 */
  .extern RTCTIMECLR       /* 0xBF8C0024 */
  .extern RTCTIMESET       /* 0xBF8C0028 */
  .extern RTCTIMEINV       /* 0xBF8C002C */
  .extern RTCDATE          /* 0xBF8C0030 */
  .extern RTCDATECLR       /* 0xBF8C0034 */
  .extern RTCDATESET       /* 0xBF8C0038 */
  .extern RTCDATEINV       /* 0xBF8C003C */
  .extern ALRMTIME         /* 0xBF8C0040 */
  .extern ALRMTIMECLR      /* 0xBF8C0044 */
  .extern ALRMTIMESET      /* 0xBF8C0048 */
  .extern ALRMTIMEINV      /* 0xBF8C004C */
  .extern ALRMDATE         /* 0xBF8C0050 */
  .extern ALRMDATECLR      /* 0xBF8C0054 */
  .extern ALRMDATESET      /* 0xBF8C0058 */
  .extern ALRMDATEINV      /* 0xBF8C005C */
  .extern DSCON            /* 0xBF8C0200 */
  .extern DSWAKE           /* 0xBF8C0204 */
  .extern DSGPR0           /* 0xBF8C0208 */
  .extern DSGPR1           /* 0xBF8C0210 */
  .extern DSGPR2           /* 0xBF8C0214 */
  .extern DSGPR3           /* 0xBF8C0218 */
  .extern DSGPR4           /* 0xBF8C021C */
  .extern DSGPR5           /* 0xBF8C0220 */
  .extern DSGPR6           /* 0xBF8C0224 */
  .extern DSGPR7           /* 0xBF8C0228 */
  .extern DSGPR8           /* 0xBF8C022C */
  .extern DSGPR9           /* 0xBF8C0230 */
  .extern DSGPR10          /* 0xBF8C0234 */
  .extern DSGPR11          /* 0xBF8C0238 */
  .extern DSGPR12          /* 0xBF8C023C */
  .extern DSGPR13          /* 0xBF8C0240 */
  .extern DSGPR14          /* 0xBF8C0244 */
  .extern DSGPR15          /* 0xBF8C0248 */
  .extern DSGPR16          /* 0xBF8C024C */
  .extern DSGPR17          /* 0xBF8C0250 */
  .extern DSGPR18          /* 0xBF8C0254 */
  .extern DSGPR19          /* 0xBF8C0258 */
  .extern DSGPR20          /* 0xBF8C025C */
  .extern DSGPR21          /* 0xBF8C0260 */
  .extern DSGPR22          /* 0xBF8C0264 */
  .extern DSGPR23          /* 0xBF8C0268 */
  .extern DSGPR24          /* 0xBF8C026C */
  .extern DSGPR25          /* 0xBF8C0270 */
  .extern DSGPR26          /* 0xBF8C0274 */
  .extern DSGPR27          /* 0xBF8C0278 */
  .extern DSGPR28          /* 0xBF8C027C */
  .extern DSGPR29          /* 0xBF8C0280 */
  .extern DSGPR30          /* 0xBF8C0284 */
  .extern DSGPR31          /* 0xBF8C0288 */
  .extern DSGPR32          /* 0xBF8C028C */
  .extern SBFLAG           /* 0xBF8F0510 */
  .extern SBT0ELOG1        /* 0xBF8F8020 */
  .extern SBT0ELOG2        /* 0xBF8F8024 */
  .extern SBT0ECON         /* 0xBF8F8028 */
  .extern SBT0ECLRS        /* 0xBF8F8030 */
  .extern SBT0ECLRM        /* 0xBF8F8038 */
  .extern SBT0REG0         /* 0xBF8F8040 */
  .extern SBT0RD0          /* 0xBF8F8050 */
  .extern SBT0WR0          /* 0xBF8F8058 */
  .extern SBT0REG1         /* 0xBF8F8060 */
  .extern SBT0RD1          /* 0xBF8F8070 */
  .extern SBT0WR1          /* 0xBF8F8078 */
  .extern SBT1ELOG1        /* 0xBF8F8420 */
  .extern SBT1ELOG2        /* 0xBF8F8424 */
  .extern SBT1ECON         /* 0xBF8F8428 */
  .extern SBT1ECLRS        /* 0xBF8F8430 */
  .extern SBT1ECLRM        /* 0xBF8F8438 */
  .extern SBT1REG0         /* 0xBF8F8440 */
  .extern SBT1RD0          /* 0xBF8F8450 */
  .extern SBT1WR0          /* 0xBF8F8458 */
  .extern SBT1REG2         /* 0xBF8F8480 */
  .extern SBT1RD2          /* 0xBF8F8490 */
  .extern SBT1WR2          /* 0xBF8F8498 */
  .extern SBT1REG3         /* 0xBF8F84A0 */
  .extern SBT1RD3          /* 0xBF8F84B0 */
  .extern SBT1WR3          /* 0xBF8F84B8 */
  .extern SBT1REG4         /* 0xBF8F84C0 */
  .extern SBT1RD4          /* 0xBF8F84D0 */
  .extern SBT1WR4          /* 0xBF8F84D8 */
  .extern SBT1REG5         /* 0xBF8F84E0 */
  .extern SBT1RD5          /* 0xBF8F84F0 */
  .extern SBT1WR5          /* 0xBF8F84F8 */
  .extern SBT1REG6         /* 0xBF8F8500 */
  .extern SBT1RD6          /* 0xBF8F8510 */
  .extern SBT1WR6          /* 0xBF8F8518 */
  .extern SBT1REG7         /* 0xBF8F8520 */
  .extern SBT1RD7          /* 0xBF8F8530 */
  .extern SBT1WR7          /* 0xBF8F8538 */
  .extern SBT1REG8         /* 0xBF8F8540 */
  .extern SBT1RD8          /* 0xBF8F8550 */
  .extern SBT1WR8          /* 0xBF8F8558 */
  .extern SBT2ELOG1        /* 0xBF8F8820 */
  .extern SBT2ELOG2        /* 0xBF8F8824 */
  .extern SBT2ECON         /* 0xBF8F8828 */
  .extern SBT2ECLRS        /* 0xBF8F8830 */
  .extern SBT2ECLRM        /* 0xBF8F8838 */
  .extern SBT2REG0         /* 0xBF8F8840 */
  .extern SBT2RD0          /* 0xBF8F8850 */
  .extern SBT2WR0          /* 0xBF8F8858 */
  .extern SBT2REG1         /* 0xBF8F8860 */
  .extern SBT2RD1          /* 0xBF8F8870 */
  .extern SBT2WR1          /* 0xBF8F8878 */
  .extern SBT2REG2         /* 0xBF8F8880 */
  .extern SBT2RD2          /* 0xBF8F8890 */
  .extern SBT2WR2          /* 0xBF8F8898 */
  .extern SBT3ELOG1        /* 0xBF8F8C20 */
  .extern SBT3ELOG2        /* 0xBF8F8C24 */
  .extern SBT3ECON         /* 0xBF8F8C28 */
  .extern SBT3ECLRS        /* 0xBF8F8C30 */
  .extern SBT3ECLRM        /* 0xBF8F8C38 */
  .extern SBT3REG0         /* 0xBF8F8C40 */
  .extern SBT3RD0          /* 0xBF8F8C50 */
  .extern SBT3WR0          /* 0xBF8F8C58 */
  .extern SBT3REG1         /* 0xBF8F8C60 */
  .extern SBT3RD1          /* 0xBF8F8C70 */
  .extern SBT3WR1          /* 0xBF8F8C78 */
  .extern SBT3REG2         /* 0xBF8F8C80 */
  .extern SBT3RD2          /* 0xBF8F8C90 */
  .extern SBT3WR2          /* 0xBF8F8C98 */
  .extern DEVCFG3          /* 0xBFC03FC0 */
  .extern DEVCFG2          /* 0xBFC03FC4 */
  .extern DEVCFG1          /* 0xBFC03FC8 */
  .extern DEVCFG0          /* 0xBFC03FCC */
  .extern DEVCP            /* 0xBFC03FDC */
  .extern DEVSIGN          /* 0xBFC03FEC */
  .extern SEQ              /* 0xBFC03FF0 */
  .extern DEVADC0          /* 0xBFC45000 */
  .extern DEVADC1          /* 0xBFC45004 */
  .extern DEVADC2          /* 0xBFC45008 */
  .extern DEVADC3          /* 0xBFC4500C */
  .extern DEVADC4          /* 0xBFC45010 */
  .extern DEVADC5          /* 0xBFC45014 */
  .extern DEVADC7          /* 0xBFC45018 */
  .extern DEVSN0           /* 0xBFC45020 */
  .extern DEVSN1           /* 0xBFC45024 */
  .extern DEVSN2           /* 0xBFC45028 */
  .extern DEVSN3           /* 0xBFC4502C */
  .extern DEVEE0           /* 0xBFC45030 */
  .extern DEVEE1           /* 0xBFC45034 */
  .extern DEVEE2           /* 0xBFC45038 */
  .extern DEVEE3           /* 0xBFC4503C */
  .extern UBADEVCFG3       /* 0xBFC23FC0 */
  .extern UBADEVCFG2       /* 0xBFC23FC4 */
  .extern UBADEVCFG1       /* 0xBFC23FC8 */
  .extern UBADEVCFG0       /* 0xBFC23FCC */
  .extern UBADEVCP         /* 0xBFC23FDC */
  .extern UBADEVSIGN       /* 0xBFC23FEC */
  .extern UBASEQ           /* 0xBFC23FF0 */
  .extern BF1DEVCFG3       /* 0xBFC43FC0 */
  .extern BF1DEVCFG2       /* 0xBFC43FC4 */
  .extern BF1DEVCFG1       /* 0xBFC43FC8 */
  .extern BF1DEVCFG0       /* 0xBFC43FCC */
  .extern BF1DEVCP         /* 0xBFC43FDC */
  .extern BF1DEVSIGN       /* 0xBFC43FEC */
  .extern BF1SEQ           /* 0xBFC43FF0 */
  .extern BF2DEVCFG3       /* 0xBFC63FC0 */
  .extern BF2DEVCFG2       /* 0xBFC63FC4 */
  .extern BF2DEVCFG1       /* 0xBFC63FC8 */
  .extern BF2DEVCFG0       /* 0xBFC63FCC */
  .extern BF2DEVCP         /* 0xBFC63FDC */
  .extern BF2DEVSIGN       /* 0xBFC63FEC */
  .extern BF2SEQ           /* 0xBFC63FF0 */
#else
#error Unknown language!
#endif

#define _CFGCON_TDOEN_POSITION                   0x00000000
#define _CFGCON_TDOEN_MASK                       0x00000001
#define _CFGCON_TDOEN_LENGTH                     0x00000001

#define _CFGCON_TROEN_POSITION                   0x00000002
#define _CFGCON_TROEN_MASK                       0x00000004
#define _CFGCON_TROEN_LENGTH                     0x00000001

#define _CFGCON_JTAGEN_POSITION                  0x00000003
#define _CFGCON_JTAGEN_MASK                      0x00000008
#define _CFGCON_JTAGEN_LENGTH                    0x00000001

#define _CFGCON_IOANCPEN_POSITION                0x00000007
#define _CFGCON_IOANCPEN_MASK                    0x00000080
#define _CFGCON_IOANCPEN_LENGTH                  0x00000001

