Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
#define _RPA1R_RPA1R_POSITION                    0x00000000
#define _RPA1R_RPA1R_MASK                        0x0000001F
#define _RPA1R_RPA1R_LENGTH                      0x00000005

#define _RPA2R_RPA2R_POSITION                    0x00000000
#define _RPA2R_RPA2R_MASK                        0x0000001F
#define _RPA2R_RPA2R_LENGTH                      0x00000005

#define _RPA3R_RPA3R_POSITION                    0x00000000
#define _RPA3R_RPA3R_MASK                        0x0000001F
#define _RPA3R_RPA3R_LENGTH                      0x00000005

#define _RPA4R_RPA4R_POSITION                    0x00000000
#define _RPA4R_RPA4R_MASK                        0x0000001F
#define _RPA4R_RPA4R_LENGTH                      0x00000005

#define _RPA7R_RPA7R_POSITION                    0x00000000
#define _RPA7R_RPA7R_MASK                        0x0000001F
#define _RPA7R_RPA7R_LENGTH                      0x00000005

#define _RPA8R_RPA8R_POSITION                    0x00000000
#define _RPA8R_RPA8R_MASK                        0x0000001F
#define _RPA8R_RPA8R_LENGTH                      0x00000005

#define _RPA11R_RPA11R_POSITION                  0x00000000
#define _RPA11R_RPA11R_MASK                      0x0000001F
#define _RPA11R_RPA11R_LENGTH                    0x00000005

#define _RPA12R_RPA12R_POSITION                  0x00000000
#define _RPA12R_RPA12R_MASK                      0x0000001F
#define _RPA12R_RPA12R_LENGTH                    0x00000005

#define _RPA14R_RPA14R_POSITION                  0x00000000
#define _RPA14R_RPA14R_MASK                      0x0000001F
#define _RPA14R_RPA14R_LENGTH                    0x00000005

#define _RPA15R_RPA15R_POSITION                  0x00000000
#define _RPA15R_RPA15R_MASK                      0x0000001F
#define _RPA15R_RPA15R_LENGTH                    0x00000005

#define _RPB0R_RPB0R_POSITION                    0x00000000
#define _RPB0R_RPB0R_MASK                        0x0000001F
#define _RPB0R_RPB0R_LENGTH                      0x00000005

#define _RPB1R_RPB1R_POSITION                    0x00000000
#define _RPB1R_RPB1R_MASK                        0x0000001F
#define _RPB1R_RPB1R_LENGTH                      0x00000005

#define _RPB2R_RPB2R_POSITION                    0x00000000
#define _RPB2R_RPB2R_MASK                        0x0000001F
#define _RPB2R_RPB2R_LENGTH                      0x00000005

#define _RPB3R_RPB3R_POSITION                    0x00000000
#define _RPB3R_RPB3R_MASK                        0x0000001F
#define _RPB3R_RPB3R_LENGTH                      0x00000005

#define _RPB4R_RPB4R_POSITION                    0x00000000
#define _RPB4R_RPB4R_MASK                        0x0000001F
#define _RPB4R_RPB4R_LENGTH                      0x00000005

#define _RPB5R_RPB5R_POSITION                    0x00000000
#define _RPB5R_RPB5R_MASK                        0x0000001F
#define _RPB5R_RPB5R_LENGTH                      0x00000005

#define _RPB6R_RPB6R_POSITION                    0x00000000
#define _RPB6R_RPB6R_MASK                        0x0000001F
#define _RPB6R_RPB6R_LENGTH                      0x00000005

#define _RPB7R_RPB7R_POSITION                    0x00000000
#define _RPB7R_RPB7R_MASK                        0x0000001F
#define _RPB7R_RPB7R_LENGTH                      0x00000005

#define _RPB9R_RPB9R_POSITION                    0x00000000
#define _RPB9R_RPB9R_MASK                        0x0000001F
#define _RPB9R_RPB9R_LENGTH                      0x00000005

#define _RPB10R_RPB10R_POSITION                  0x00000000
#define _RPB10R_RPB10R_MASK                      0x0000001F
#define _RPB10R_RPB10R_LENGTH                    0x00000005

#define _RPB11R_RPB11R_POSITION                  0x00000000
#define _RPB11R_RPB11R_MASK                      0x0000001F
#define _RPB11R_RPB11R_LENGTH                    0x00000005

#define _RPB12R_RPB12R_POSITION                  0x00000000
#define _RPB12R_RPB12R_MASK                      0x0000001F
#define _RPB12R_RPB12R_LENGTH                    0x00000005

#define _RPB13R_RPB13R_POSITION                  0x00000000
#define _RPB13R_RPB13R_MASK                      0x0000001F
#define _RPB13R_RPB13R_LENGTH                    0x00000005

#define _RPB14R_RPB14R_POSITION                  0x00000000
#define _RPB14R_RPB14R_MASK                      0x0000001F
#define _RPB14R_RPB14R_LENGTH                    0x00000005

#define _RPB15R_RPB15R_POSITION                  0x00000000
#define _RPB15R_RPB15R_MASK                      0x0000001F
#define _RPB15R_RPB15R_LENGTH                    0x00000005

#define _RPC0R_RPC0R_POSITION                    0x00000000
#define _RPC0R_RPC0R_MASK                        0x0000001F
#define _RPC0R_RPC0R_LENGTH                      0x00000005

#define _RPC1R_RPC1R_POSITION                    0x00000000
#define _RPC1R_RPC1R_MASK                        0x0000001F
#define _RPC1R_RPC1R_LENGTH                      0x00000005

#define _RPC2R_RPC2R_POSITION                    0x00000000
#define _RPC2R_RPC2R_MASK                        0x0000001F
#define _RPC2R_RPC2R_LENGTH                      0x00000005

#define _RPC4R_RPC4R_POSITION                    0x00000000
#define _RPC4R_RPC4R_MASK                        0x0000001F
#define _RPC4R_RPC4R_LENGTH                      0x00000005

#define _RPC6R_RPC6R_POSITION                    0x00000000
#define _RPC6R_RPC6R_MASK                        0x0000001F
#define _RPC6R_RPC6R_LENGTH                      0x00000005

#define _RPC7R_RPC7R_POSITION                    0x00000000
#define _RPC7R_RPC7R_MASK                        0x0000001F
#define _RPC7R_RPC7R_LENGTH                      0x00000005

#define _RPC8R_RPC8R_POSITION                    0x00000000
#define _RPC8R_RPC8R_MASK                        0x0000001F
#define _RPC8R_RPC8R_LENGTH                      0x00000005

#define _RPC9R_RPC9R_POSITION                    0x00000000
#define _RPC9R_RPC9R_MASK                        0x0000001F
#define _RPC9R_RPC9R_LENGTH                      0x00000005

#define _RPC10R_RPC10R_POSITION                  0x00000000
#define _RPC10R_RPC10R_MASK                      0x0000001F
#define _RPC10R_RPC10R_LENGTH                    0x00000005

