Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
#define _PTMR8_TMR_POSITION                      0x00000000
#define _PTMR8_TMR_MASK                          0x0000FFFF
#define _PTMR8_TMR_LENGTH                        0x00000010

#define _PWMCON9_XPRES_POSITION                  0x00000001
#define _PWMCON9_XPRES_MASK                      0x00000002
#define _PWMCON9_XPRES_LENGTH                    0x00000001

#define _PWMCON9_MTBS_POSITION                   0x00000003
#define _PWMCON9_MTBS_MASK                       0x00000008
#define _PWMCON9_MTBS_LENGTH                     0x00000001

#define _PWMCON9_PTDIR_POSITION                  0x00000004
#define _PWMCON9_PTDIR_MASK                      0x00000010
#define _PWMCON9_PTDIR_LENGTH                    0x00000001

#define _PWMCON9_DTCP_POSITION                   0x00000005
#define _PWMCON9_DTCP_MASK                       0x00000020
#define _PWMCON9_DTCP_LENGTH                     0x00000001

#define _PWMCON9_DTC_POSITION                    0x00000006
#define _PWMCON9_DTC_MASK                        0x000000C0
#define _PWMCON9_DTC_LENGTH                      0x00000002

#define _PWMCON9_ITB_POSITION                    0x00000009
#define _PWMCON9_ITB_MASK                        0x00000200
#define _PWMCON9_ITB_LENGTH                      0x00000001

#define _PWMCON9_ECAM_POSITION                   0x0000000A
#define _PWMCON9_ECAM_MASK                       0x00000C00
#define _PWMCON9_ECAM_LENGTH                     0x00000002

#define _PWMCON9_CLTSTAT_POSITION                0x0000000E
#define _PWMCON9_CLTSTAT_MASK                    0x00004000
#define _PWMCON9_CLTSTAT_LENGTH                  0x00000001

#define _PWMCON9_FLTSTAT_POSITION                0x0000000F
#define _PWMCON9_FLTSTAT_MASK                    0x00008000
#define _PWMCON9_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON9_PWMHIEN_POSITION                0x00000013
#define _PWMCON9_PWMHIEN_MASK                    0x00080000
#define _PWMCON9_PWMHIEN_LENGTH                  0x00000001

#define _PWMCON9_PWMLIEN_POSITION                0x00000014
#define _PWMCON9_PWMLIEN_MASK                    0x00100000
#define _PWMCON9_PWMLIEN_LENGTH                  0x00000001

#define _PWMCON9_TRGIEN_POSITION                 0x00000015
#define _PWMCON9_TRGIEN_MASK                     0x00200000
#define _PWMCON9_TRGIEN_LENGTH                   0x00000001

#define _PWMCON9_CLIEN_POSITION                  0x00000016
#define _PWMCON9_CLIEN_MASK                      0x00400000
#define _PWMCON9_CLIEN_LENGTH                    0x00000001

#define _PWMCON9_FLTIEN_POSITION                 0x00000017
#define _PWMCON9_FLTIEN_MASK                     0x00800000
#define _PWMCON9_FLTIEN_LENGTH                   0x00000001

#define _PWMCON9_PWMHIF_POSITION                 0x0000001B
#define _PWMCON9_PWMHIF_MASK                     0x08000000
#define _PWMCON9_PWMHIF_LENGTH                   0x00000001

#define _PWMCON9_PWMLIF_POSITION                 0x0000001C
#define _PWMCON9_PWMLIF_MASK                     0x10000000
#define _PWMCON9_PWMLIF_LENGTH                   0x00000001

#define _PWMCON9_TRGIF_POSITION                  0x0000001D
#define _PWMCON9_TRGIF_MASK                      0x20000000
#define _PWMCON9_TRGIF_LENGTH                    0x00000001

#define _PWMCON9_CLIF_POSITION                   0x0000001E
#define _PWMCON9_CLIF_MASK                       0x40000000
#define _PWMCON9_CLIF_LENGTH                     0x00000001

#define _PWMCON9_FLTIF_POSITION                  0x0000001F
#define _PWMCON9_FLTIF_MASK                      0x80000000
#define _PWMCON9_FLTIF_LENGTH                    0x00000001

#define _IOCON9_OSYNC_POSITION                   0x00000000
#define _IOCON9_OSYNC_MASK                       0x00000001
#define _IOCON9_OSYNC_LENGTH                     0x00000001

#define _IOCON9_SWAP_POSITION                    0x00000001
#define _IOCON9_SWAP_MASK                        0x00000002
#define _IOCON9_SWAP_LENGTH                      0x00000001

#define _IOCON9_CLDAT_POSITION                   0x00000002
#define _IOCON9_CLDAT_MASK                       0x0000000C
#define _IOCON9_CLDAT_LENGTH                     0x00000002

#define _IOCON9_FLTDAT_POSITION                  0x00000004
#define _IOCON9_FLTDAT_MASK                      0x00000030
#define _IOCON9_FLTDAT_LENGTH                    0x00000002

#define _IOCON9_OVRDAT_POSITION                  0x00000006
#define _IOCON9_OVRDAT_MASK                      0x000000C0
#define _IOCON9_OVRDAT_LENGTH                    0x00000002

#define _IOCON9_OVRENL_POSITION                  0x00000008
#define _IOCON9_OVRENL_MASK                      0x00000100
#define _IOCON9_OVRENL_LENGTH                    0x00000001

#define _IOCON9_OVRENH_POSITION                  0x00000009
#define _IOCON9_OVRENH_MASK                      0x00000200
#define _IOCON9_OVRENH_LENGTH                    0x00000001

#define _IOCON9_PMOD_POSITION                    0x0000000A
#define _IOCON9_PMOD_MASK                        0x00000C00
#define _IOCON9_PMOD_LENGTH                      0x00000002

#define _IOCON9_POLL_POSITION                    0x0000000C
#define _IOCON9_POLL_MASK                        0x00001000
#define _IOCON9_POLL_LENGTH                      0x00000001

#define _IOCON9_POLH_POSITION                    0x0000000D
#define _IOCON9_POLH_MASK                        0x00002000
#define _IOCON9_POLH_LENGTH                      0x00000001

#define _IOCON9_PENL_POSITION                    0x0000000E
#define _IOCON9_PENL_MASK                        0x00004000
#define _IOCON9_PENL_LENGTH                      0x00000001

#define _IOCON9_PENH_POSITION                    0x0000000F
#define _IOCON9_PENH_MASK                        0x00008000
#define _IOCON9_PENH_LENGTH                      0x00000001

#define _IOCON9_FLTMOD_POSITION                  0x00000010
#define _IOCON9_FLTMOD_MASK                      0x00030000
#define _IOCON9_FLTMOD_LENGTH                    0x00000002

#define _IOCON9_FLTPOL_POSITION                  0x00000012
#define _IOCON9_FLTPOL_MASK                      0x00040000
#define _IOCON9_FLTPOL_LENGTH                    0x00000001

#define _IOCON9_FLTSRC_POSITION                  0x00000013
#define _IOCON9_FLTSRC_MASK                      0x00780000
#define _IOCON9_FLTSRC_LENGTH                    0x00000004

#define _IOCON9_CLMOD_POSITION                   0x00000018
#define _IOCON9_CLMOD_MASK                       0x01000000
#define _IOCON9_CLMOD_LENGTH                     0x00000001

#define _IOCON9_CLPOL_POSITION                   0x00000019
#define _IOCON9_CLPOL_MASK                       0x02000000
#define _IOCON9_CLPOL_LENGTH                     0x00000001

#define _IOCON9_CLSRC_POSITION                   0x0000001A
#define _IOCON9_CLSRC_MASK                       0x3C000000
#define _IOCON9_CLSRC_LENGTH                     0x00000004

#define _PDC9_PDC_POSITION                       0x00000000
#define _PDC9_PDC_MASK                           0x0000FFFF
#define _PDC9_PDC_LENGTH                         0x00000010

