Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
#define _PWMCON10_PWMLIEN_POSITION               0x00000014
#define _PWMCON10_PWMLIEN_MASK                   0x00100000
#define _PWMCON10_PWMLIEN_LENGTH                 0x00000001

#define _PWMCON10_TRGIEN_POSITION                0x00000015
#define _PWMCON10_TRGIEN_MASK                    0x00200000
#define _PWMCON10_TRGIEN_LENGTH                  0x00000001

#define _PWMCON10_CLIEN_POSITION                 0x00000016
#define _PWMCON10_CLIEN_MASK                     0x00400000
#define _PWMCON10_CLIEN_LENGTH                   0x00000001

#define _PWMCON10_FLTIEN_POSITION                0x00000017
#define _PWMCON10_FLTIEN_MASK                    0x00800000
#define _PWMCON10_FLTIEN_LENGTH                  0x00000001

#define _PWMCON10_PWMHIF_POSITION                0x0000001B
#define _PWMCON10_PWMHIF_MASK                    0x08000000
#define _PWMCON10_PWMHIF_LENGTH                  0x00000001

#define _PWMCON10_PWMLIF_POSITION                0x0000001C
#define _PWMCON10_PWMLIF_MASK                    0x10000000
#define _PWMCON10_PWMLIF_LENGTH                  0x00000001

#define _PWMCON10_TRGIF_POSITION                 0x0000001D
#define _PWMCON10_TRGIF_MASK                     0x20000000
#define _PWMCON10_TRGIF_LENGTH                   0x00000001

#define _PWMCON10_CLIF_POSITION                  0x0000001E
#define _PWMCON10_CLIF_MASK                      0x40000000
#define _PWMCON10_CLIF_LENGTH                    0x00000001

#define _PWMCON10_FLTIF_POSITION                 0x0000001F
#define _PWMCON10_FLTIF_MASK                     0x80000000
#define _PWMCON10_FLTIF_LENGTH                   0x00000001

#define _IOCON10_OSYNC_POSITION                  0x00000000
#define _IOCON10_OSYNC_MASK                      0x00000001
#define _IOCON10_OSYNC_LENGTH                    0x00000001

#define _IOCON10_SWAP_POSITION                   0x00000001
#define _IOCON10_SWAP_MASK                       0x00000002
#define _IOCON10_SWAP_LENGTH                     0x00000001

#define _IOCON10_CLDAT_POSITION                  0x00000002
#define _IOCON10_CLDAT_MASK                      0x0000000C
#define _IOCON10_CLDAT_LENGTH                    0x00000002

#define _IOCON10_FLTDAT_POSITION                 0x00000004
#define _IOCON10_FLTDAT_MASK                     0x00000030
#define _IOCON10_FLTDAT_LENGTH                   0x00000002

#define _IOCON10_OVRDAT_POSITION                 0x00000006
#define _IOCON10_OVRDAT_MASK                     0x000000C0
#define _IOCON10_OVRDAT_LENGTH                   0x00000002

#define _IOCON10_OVRENL_POSITION                 0x00000008
#define _IOCON10_OVRENL_MASK                     0x00000100
#define _IOCON10_OVRENL_LENGTH                   0x00000001

#define _IOCON10_OVRENH_POSITION                 0x00000009
#define _IOCON10_OVRENH_MASK                     0x00000200
#define _IOCON10_OVRENH_LENGTH                   0x00000001

#define _IOCON10_PMOD_POSITION                   0x0000000A
#define _IOCON10_PMOD_MASK                       0x00000C00
#define _IOCON10_PMOD_LENGTH                     0x00000002

#define _IOCON10_POLL_POSITION                   0x0000000C
#define _IOCON10_POLL_MASK                       0x00001000
#define _IOCON10_POLL_LENGTH                     0x00000001

#define _IOCON10_POLH_POSITION                   0x0000000D
#define _IOCON10_POLH_MASK                       0x00002000
#define _IOCON10_POLH_LENGTH                     0x00000001

#define _IOCON10_PENL_POSITION                   0x0000000E
#define _IOCON10_PENL_MASK                       0x00004000
#define _IOCON10_PENL_LENGTH                     0x00000001

#define _IOCON10_PENH_POSITION                   0x0000000F
#define _IOCON10_PENH_MASK                       0x00008000
#define _IOCON10_PENH_LENGTH                     0x00000001

#define _IOCON10_FLTMOD_POSITION                 0x00000010
#define _IOCON10_FLTMOD_MASK                     0x00030000
#define _IOCON10_FLTMOD_LENGTH                   0x00000002

#define _IOCON10_FLTPOL_POSITION                 0x00000012
#define _IOCON10_FLTPOL_MASK                     0x00040000
#define _IOCON10_FLTPOL_LENGTH                   0x00000001

#define _IOCON10_FLTSRC_POSITION                 0x00000013
#define _IOCON10_FLTSRC_MASK                     0x00780000
#define _IOCON10_FLTSRC_LENGTH                   0x00000004

#define _IOCON10_CLMOD_POSITION                  0x00000018
#define _IOCON10_CLMOD_MASK                      0x01000000
#define _IOCON10_CLMOD_LENGTH                    0x00000001

#define _IOCON10_CLPOL_POSITION                  0x00000019
#define _IOCON10_CLPOL_MASK                      0x02000000
#define _IOCON10_CLPOL_LENGTH                    0x00000001

#define _IOCON10_CLSRC_POSITION                  0x0000001A
#define _IOCON10_CLSRC_MASK                      0x3C000000
#define _IOCON10_CLSRC_LENGTH                    0x00000004

#define _PDC10_PDC_POSITION                      0x00000000
#define _PDC10_PDC_MASK                          0x0000FFFF
#define _PDC10_PDC_LENGTH                        0x00000010

#define _SDC10_SDC_POSITION                      0x00000000
#define _SDC10_SDC_MASK                          0x0000FFFF
#define _SDC10_SDC_LENGTH                        0x00000010

#define _PHASE10_PHASE_POSITION                  0x00000000
#define _PHASE10_PHASE_MASK                      0x0000FFFF
#define _PHASE10_PHASE_LENGTH                    0x00000010

#define _DTR10_DTR_POSITION                      0x00000000
#define _DTR10_DTR_MASK                          0x0000FFFF
#define _DTR10_DTR_LENGTH                        0x00000010

#define _ALTDTR10_ALTDTR_POSITION                0x00000000
#define _ALTDTR10_ALTDTR_MASK                    0x0000FFFF
#define _ALTDTR10_ALTDTR_LENGTH                  0x00000010

#define _DTCOMP10_COMP_POSITION                  0x00000000
#define _DTCOMP10_COMP_MASK                      0x00003FFF
#define _DTCOMP10_COMP_LENGTH                    0x0000000E

#define _TRIG10_TRGCMP_POSITION                  0x00000000
#define _TRIG10_TRGCMP_MASK                      0x0000FFFF
#define _TRIG10_TRGCMP_LENGTH                    0x00000010

#define _TRGCON10_STRGIS_POSITION                0x00000006
#define _TRGCON10_STRGIS_MASK                    0x00000040
#define _TRGCON10_STRGIS_LENGTH                  0x00000001

#define _TRGCON10_DTM_POSITION                   0x00000007
#define _TRGCON10_DTM_MASK                       0x00000080
#define _TRGCON10_DTM_LENGTH                     0x00000001

#define _TRGCON10_STRGSEL_POSITION               0x00000008
#define _TRGCON10_STRGSEL_MASK                   0x00000300
#define _TRGCON10_STRGSEL_LENGTH                 0x00000002

