Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk1024mcf100.h
#define _PTGQUE4_STEP19_POSITION                 0x00000018
#define _PTGQUE4_STEP19_MASK                     0xFF000000
#define _PTGQUE4_STEP19_LENGTH                   0x00000008

#define _PTGQUE5_STEP20_POSITION                 0x00000000
#define _PTGQUE5_STEP20_MASK                     0x000000FF
#define _PTGQUE5_STEP20_LENGTH                   0x00000008

#define _PTGQUE5_STEP21_POSITION                 0x00000008
#define _PTGQUE5_STEP21_MASK                     0x0000FF00
#define _PTGQUE5_STEP21_LENGTH                   0x00000008

#define _PTGQUE5_STEP22_POSITION                 0x00000010
#define _PTGQUE5_STEP22_MASK                     0x00FF0000
#define _PTGQUE5_STEP22_LENGTH                   0x00000008

#define _PTGQUE5_STEP23_POSITION                 0x00000018
#define _PTGQUE5_STEP23_MASK                     0xFF000000
#define _PTGQUE5_STEP23_LENGTH                   0x00000008

#define _PTGQUE6_STEP24_POSITION                 0x00000000
#define _PTGQUE6_STEP24_MASK                     0x000000FF
#define _PTGQUE6_STEP24_LENGTH                   0x00000008

#define _PTGQUE6_STEP25_POSITION                 0x00000008
#define _PTGQUE6_STEP25_MASK                     0x0000FF00
#define _PTGQUE6_STEP25_LENGTH                   0x00000008

#define _PTGQUE6_STEP26_POSITION                 0x00000010
#define _PTGQUE6_STEP26_MASK                     0x00FF0000
#define _PTGQUE6_STEP26_LENGTH                   0x00000008

#define _PTGQUE6_STEP27_POSITION                 0x00000018
#define _PTGQUE6_STEP27_MASK                     0xFF000000
#define _PTGQUE6_STEP27_LENGTH                   0x00000008

#define _PTGQUE7_STEP28_POSITION                 0x00000000
#define _PTGQUE7_STEP28_MASK                     0x000000FF
#define _PTGQUE7_STEP28_LENGTH                   0x00000008

#define _PTGQUE7_STEP29_POSITION                 0x00000008
#define _PTGQUE7_STEP29_MASK                     0x0000FF00
#define _PTGQUE7_STEP29_LENGTH                   0x00000008

#define _PTGQUE7_STEP30_POSITION                 0x00000010
#define _PTGQUE7_STEP30_MASK                     0x00FF0000
#define _PTGQUE7_STEP30_LENGTH                   0x00000008

#define _PTGQUE7_STEP31_POSITION                 0x00000018
#define _PTGQUE7_STEP31_MASK                     0xFF000000
#define _PTGQUE7_STEP31_LENGTH                   0x00000008

#define _QEI1CON_CCM_POSITION                    0x00000000
#define _QEI1CON_CCM_MASK                        0x00000003
#define _QEI1CON_CCM_LENGTH                      0x00000002

#define _QEI1CON_GATEN_POSITION                  0x00000002
#define _QEI1CON_GATEN_MASK                      0x00000004
#define _QEI1CON_GATEN_LENGTH                    0x00000001

#define _QEI1CON_CNTPOL_POSITION                 0x00000003
#define _QEI1CON_CNTPOL_MASK                     0x00000008
#define _QEI1CON_CNTPOL_LENGTH                   0x00000001

#define _QEI1CON_INTDIV_POSITION                 0x00000004
#define _QEI1CON_INTDIV_MASK                     0x00000070
#define _QEI1CON_INTDIV_LENGTH                   0x00000003

#define _QEI1CON_IMV_POSITION                    0x00000008
#define _QEI1CON_IMV_MASK                        0x00000300
#define _QEI1CON_IMV_LENGTH                      0x00000002

#define _QEI1CON_PIMOD_POSITION                  0x0000000A
#define _QEI1CON_PIMOD_MASK                      0x00001C00
#define _QEI1CON_PIMOD_LENGTH                    0x00000003

#define _QEI1CON_QEISIDL_POSITION                0x0000000D
#define _QEI1CON_QEISIDL_MASK                    0x00002000
#define _QEI1CON_QEISIDL_LENGTH                  0x00000001

#define _QEI1CON_QEIEN_POSITION                  0x0000000F
#define _QEI1CON_QEIEN_MASK                      0x00008000
#define _QEI1CON_QEIEN_LENGTH                    0x00000001

#define _QEI1IOC_QEA_POSITION                    0x00000000
#define _QEI1IOC_QEA_MASK                        0x00000001
#define _QEI1IOC_QEA_LENGTH                      0x00000001

#define _QEI1IOC_QEB_POSITION                    0x00000001
#define _QEI1IOC_QEB_MASK                        0x00000002
#define _QEI1IOC_QEB_LENGTH                      0x00000001

#define _QEI1IOC_INDEX_POSITION                  0x00000002
#define _QEI1IOC_INDEX_MASK                      0x00000004
#define _QEI1IOC_INDEX_LENGTH                    0x00000001

#define _QEI1IOC_HOME_POSITION                   0x00000003
#define _QEI1IOC_HOME_MASK                       0x00000008
#define _QEI1IOC_HOME_LENGTH                     0x00000001

#define _QEI1IOC_QEAPOL_POSITION                 0x00000004
#define _QEI1IOC_QEAPOL_MASK                     0x00000010
#define _QEI1IOC_QEAPOL_LENGTH                   0x00000001

#define _QEI1IOC_QEBPOL_POSITION                 0x00000005
#define _QEI1IOC_QEBPOL_MASK                     0x00000020
#define _QEI1IOC_QEBPOL_LENGTH                   0x00000001

#define _QEI1IOC_IDXPOL_POSITION                 0x00000006
#define _QEI1IOC_IDXPOL_MASK                     0x00000040
#define _QEI1IOC_IDXPOL_LENGTH                   0x00000001

#define _QEI1IOC_HOMPOL_POSITION                 0x00000007
#define _QEI1IOC_HOMPOL_MASK                     0x00000080
#define _QEI1IOC_HOMPOL_LENGTH                   0x00000001

#define _QEI1IOC_SWPAB_POSITION                  0x00000008
#define _QEI1IOC_SWPAB_MASK                      0x00000100
#define _QEI1IOC_SWPAB_LENGTH                    0x00000001

#define _QEI1IOC_OUTFNC_POSITION                 0x00000009
#define _QEI1IOC_OUTFNC_MASK                     0x00000600
#define _QEI1IOC_OUTFNC_LENGTH                   0x00000002

#define _QEI1IOC_QFDIV_POSITION                  0x0000000B
#define _QEI1IOC_QFDIV_MASK                      0x00003800
#define _QEI1IOC_QFDIV_LENGTH                    0x00000003

#define _QEI1IOC_FLTREN_POSITION                 0x0000000E
#define _QEI1IOC_FLTREN_MASK                     0x00004000
#define _QEI1IOC_FLTREN_LENGTH                   0x00000001

#define _QEI1IOC_QCAPEN_POSITION                 0x0000000F
#define _QEI1IOC_QCAPEN_MASK                     0x00008000
#define _QEI1IOC_QCAPEN_LENGTH                   0x00000001

#define _QEI1IOC_HCAPEN_POSITION                 0x00000010
#define _QEI1IOC_HCAPEN_MASK                     0x00010000
#define _QEI1IOC_HCAPEN_LENGTH                   0x00000001

#define _QEI1STAT_IDXIEN_POSITION                0x00000000
#define _QEI1STAT_IDXIEN_MASK                    0x00000001
#define _QEI1STAT_IDXIEN_LENGTH                  0x00000001

